[
    {
        "ano": 2016,
        "nr_simposio": "XXXIV",
        "simposio": "SBRC",
        "cidade": "Salvador",
        "estado": "BA",
        "anais": [
            {
                "titulo": "Trabalho Colaborativo em Serviços de Armazenamento na Nuvem: Uma Análise do Dropbox",
                "paginas": 14,
                "autores": "Glauber Dias Gonçalves, Alex Borges Vieira Ana Paula Couto da Silva, Jussara M. Almeida",
                "universidade": "Departamento de Ciência da Computação - Universidade Federal de Minas Gerais Departamento de Ciência da Computação - Universidade Federal de Juiz de Fora",
                "lingua": "Pt",
                "resumo": "Provedores de serviços de armazenamento na nuvem adotam várias medidas para incentivar a atividade de seus usuários bem como atrair novos usuários. Uma das ações adotadas pelos principais provedores com esse propósito é oferecer a opção de realizar trabalho colaborativo, via compartilhamento de dados entre usuários em rede. Neste estudo, nós investigamos a relação entre trabalho colaborativo e o nível de atividade dos usuários do Dropbox, um dos serviços mais populares atualmente. Nós medimos o volume do tráfego que os usuários geram à medida que armazenam dados na nuvem e realizam compartilhamentos, utilizando dados coletados de quatro redes distintas. Nossos resultados indicam que usuários engajados em trabalhos colaborativos sincronizam maior volume de dados com a nuvem. Logo, esses usuários tem maior atividade e potencialmente pagam ou podem vir a pagar pelo serviço, sugerindo que, apesar dos custos, a funcionalidade de trabalho colaborativo pode aumentar a receita dos provedores de armazenamento na nuvem. Abstract. Cloud storage service providers have adopted several measures to incentivize the activity of their users as well as attract new ones. One of actions adopted by the major providers for this purpose is to provide the option to carry out collaborative work via data sharing between networked users. In this study, we investigate the relationship between collaborative work and the activity level of the users of Dropbox, one of the most popular services currently. We measure the trafﬁc volume that users generate as they store data in the cloud and make shared folders using data collected from four different networks. Our results indicate that users participating in collaborative work synchronize more data to the cloud. Therefore, these users have higher activity and potentially can pay for the service, suggesting that, despite its cost, collaborative work feature can increase revenue of cloud storage providers.",
                "link": ""
            },
            {
                "titulo": "Caracterização do Serviço de Táxi a partir de Corridas Solicitadas por um Aplicativo de  Smartphone",
                "paginas": 14,
                "autores": "Átila M. Silva Júnior, Miguel L. M. Sousa, Faber Z. Xavier, Wender Z. Xavier Jussara M. Almeida, Artur Ziviani, Francisco Rangel, Cláudio  Avila Humberto T. Marques-Neto",
                "universidade": "Pontifícia Universidade Católica de Minas Gerais (PUC Minas) 30.535-901 - Belo Horizonte - Brasil Universidade Federal de Minas Gerais (UFMG) 31.270-010 - Belo Horizonte - Brasil Laboratório Nacional de Computação Cientíﬁca (LNCC/MCTI) 25.651-075 - Petrópolis - Brasil WayTaxi - Belo Horizonte - Brasil",
                "lingua": "Pt",
                "resumo": "O uso de aplicativos de smartphones gera uma grande quantidade de dados sobre a movimentação de pessoas em grandes centros urbanos. Isto cria possibilidades de avaliação da mobilidade humana que, de certa forma, pode direcionar evoluções da infraestrutura da rede de acesso à Internet móvel bem como desses sistemas. Os aplicativos utilizados para realização de chamadas de táxi são exemplos de fontes de dados capazes de subsidiar estudos sobre a mobilidade humana e sobre o comportamento de usuários desses sistemas. Neste trabalho foi realizada uma caracterização de corridas de táxi solicitadas através de um aplicativo de smartphone na cidade de Belo Horizonte. Foram analisadas 37.183 corridas solicitadas por 16.442 passageiros e atendidas por 3.663 taxistas durante uma semana. Pòde-se constatar que 51% das corridas foram solicitadas em uma área especíﬁca da cidade e dentre os cancelamentos, 49% foram realizados até o primeiro minuto de espera. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 17",
                "link": ""
            },
            {
                "titulo": "Classiﬁcando Comportamentos Sociais em Redes Veiculares",
                "paginas": 16,
                "autores": "Davidysson A. Alvarenga, Felipe D. Cunha, Aline C. Viana Raquel A. F. Mini, Antònio A. F. Loureiro",
                "universidade": "DCC – Pontifícia Universidade Católica de Minas Gerais (PUC-Minas) DCC – Universidade Federal de Minas Gerais (UFMG) INRIA – France",
                "lingua": "Pt",
                "resumo": "Redes veiculares são redes formadas por veículos que transitam nas cidades e rodovias. Durante suas trajetórias estes veículos interagem uns com outros veículos com o objetivo de tornar o trafego mais seguro e a viagem agradável. Essas interações podem ser inﬂuenciadas por diversos fatores. Dentre eles pode-se citar: a velocidade do veículo, as condições das vias e o período do dia. Além disso, o comportamento do condutor e seus interesses podem inﬂuenciar em muitas características do veículo. Nesse contexto, surgem as Redes Sociais Veiculares como uma nova perspectiva para as redes veiculares. Essas são redes nas quais os veículos “socializam” e compartilham interesses comuns. Neste trabalho serão avaliados o comportamento dos veículos em dois cenários de mobilidade, com o objetivo de classiﬁcá-los de acordo com as interações realizadas, identiﬁcando interesses comuns e rotinas semelhantes. Para isso, foram utilizadas métricas de redes complexas e técnicas estatísticas. Resultados comprovam a existência de rotinas e propriedades sociais nas Redes Veiculares.",
                "link": ""
            },
            {
                "titulo": "Especiﬁcação de Replicação Máquina de Estados Dinâmica",
                "paginas": 14,
                "autores": "Eduardo Adilio Pelinson Alchieri, Alysson Neves Bessani, João Sousa 1. Introdução",
                "universidade": "Departamento de Ciência da Computação, Universidade de Brasília Faculdade de Ciências, Universidade de Lisboa A Replicação Máquina de Estados (RME) [Schneider 1990, Lamport 1998] é uma abordagem muito utilizada na implementação de sistemas tolerantes a falhas, tanto por pa- rada [Lamport 1998, Schneider 1990] quanto Bizantinas [Castro and Liskov 2002]. Esta abordagem consiste em replicar os servidores e coordenar as interações entre os clientes e estas réplicas, com o intuito de que as mesmas apresentem a mesma evolução em seus estados, garantindo o determinismo de réplicas. grande maioria das concretizações existentes para RME (ex.: [Castro and Liskov 2002, Clement et al. 2009, Santos and Schiper 2013]) conside- ram que o conjunto de réplicas que implementam o sistema nunca sofre alterações. Esta abordagem impossibilita, por exemplo, que durante a execução do sistema novas réplicas sejam adicionadas e/ou réplicas antigas sejam removidas em tempo de execução. No entanto, muitos sistemas necessitam executar estas ações quando querem aumentar ou diminuir o limite de falhas toleradas ou ainda trocar um servidor antigo com uma conﬁguração obsoleta por um servidor atualizado. Para isso, surge a necessidade de  do sistema.",
                "lingua": "Pt",
                "resumo": "A replicação Máquina de Estados (RME), abordagem muito utilizada na implementação de sistemas tolerantes a falhas, consiste em replicar os servidores e coordenar as interações entre os clientes e as réplicas, com o intuito de que as mesmas apresentem a mesma evolução em seus estados. Apesar de alguns sistemas implementarem uma RME com capacidade de reconﬁguração, não existe nenhuma especiﬁcação a respeito dos aspectos relacionados com a reconﬁguração de uma RME. Neste sentido, este artigo especiﬁca as propriedades e as suposições necessárias para uma RME dinâmica, além de propor um protocolo que satisfaz estas propriedades. Além disso, apresenta uma avaliação experimental que facilita o entendimento e mostra a viabilidade prática de uma RME dinâmica. Abstract. State Machine Replication is an approach widely used to implement fault-tolerant systems. The idea behind this approach is to replicate the servers and to coordinate the interactions among clients and servers replicas, making all of these replicas present the same state evolution. Although some systems implement a reconﬁgurable RME, this approach has not yet been fully speciﬁed. In this sense, this paper speciﬁes the properties and the assumptions that are necessary to a reconﬁgurable RME. Moreover, it presents a protocol that satisﬁes these properties and an experimental evaluation that shows the practical feasibility of this approach.",
                "link": ""
            },
            {
                "titulo": "Replicação Tolerante a Faltas Eﬁciente em Bancos de Dados Orientados a Grafos",
                "paginas": 14,
                "autores": "Ray Willy Neiheiser, Lau Cheuk Lung, Aldelir Fernando Luiz Hylson Vescovi Netto",
                "universidade": "Departamento de Informática e Estatística – Universidade Federal de Santa Catarina  Blumenau – Instituto Federal de Educação, Ciência e Tecnologia Catarinense",
                "lingua": "Pt",
                "resumo": "Com o crescimento das redes sociais e o aumento no volume de dados altamente conectados, a tecnologia banco de dados baseada em grafos tem ganhado notória importância. A replicação de dados, que é uma técnica amplamente adotada no âmbito de bancos de dados tradicionais, é também passível de implementação em soluções de bancos de dados baseados em grafos. Porém, as abordagens existentes noutros ambientes de banco de dados oferecem pouca escalabilidade e desempenho. Neste sentido, este trabalho introduz a técnica de atualização tardia (i.e., deferred update) no contexto de sistemas bancos de dados orientados a grafos. A solução proposta consiste numa adaptação do algoritmo clássico desta abordagem, de modo a possibilitar uma replicação bastante escalável, e com desempenho superior quando comparado à replicação tradicional.",
                "link": ""
            },
            {
                "titulo": "Replicação de Máquinas de Estado em  containers  no Kubernetes: uma Proposta de Integração",
                "paginas": 16,
                "autores": "Hylson Netto, Lau Cheuk Lung, Miguel Correia, Aldelir Fernando Luiz",
                "universidade": "Departamento de Informática e Estatística – Universidade Federal de Santa Catarina Campus Blumenau – Instituto Federal de Educação, Ciência e Tecnologia Catarinense INESC-ID – Instituto Superior Técnico – Universidade de Lisboa – Portugal",
                "lingua": "Pt",
                "resumo": "A virtualização de computadores permitiu um provisionamento dinâmico de recursos nos data centers e um consequente modelo de cobrança de serviços de acordo com utilização. A virtualização em nível de sistema por meio dos containers tornou mais dinâmica essa capacidade de provisionamento. Em aplicações que requerem garantias mais restritivas de acordo e ordenação, ferramentas de coordenação podem ser utilizadas em nível de aplicação para esse ﬁm. Este artigo propõe uma integração do serviço de coordenação na arquitetura do sistema Kubernetes, um orquestrador de containers, com o objetivo de manter os containers os menores possíveis e oferecer à aplicação a capacidade de replicar estados automaticamente. Um protocolo que utiliza memória compartilhada disponível no Kubernetes foi desenvolvido para atuar na arquitetura, e uma avaliação foi realizada para demonstrar a viabilidade da proposta. Abstract. Computer virtualization brought fast resource provisioning to data centers and also the deployment of a pay-per-use cost model. The system virtualization provided by containers has improved this versatility of resource provisioning. Applications that require more restrictive agreement and ordering warranties can use speciﬁc tools to achieve their goals. This paper proposes the integration of coordination services in the Kubernetes architecture in order to maintain containers as small as possible and offer automatic state replication. A protocol that uses shared memory available in Kubernetes was developed, and an evaluation was conducted to show the viability of the proposal.",
                "link": ""
            },
            {
                "titulo": "Uma metodologia para identiﬁcação adaptativa e caracterização de phishing",
                "paginas": 14,
                "autores": "Pedro Henrique B. Las-Casas, Osvaldo Fonseca, Elverton Fazzion Cristine Hoepers, Klaus Steding-Jessen, Marcelo H. P. Chaves Ítalo Cunha, Wagner Meira Jr., Dorgival Guedes",
                "universidade": "Departamento de Ciência da Computação Universidade Federal de Minas Gerais CERT.br - Centro de Estudos, Resposta e Tratamento de Incidentes de Segurança NIC.br - Núcleo de Informação e Coordenação do Ponto BR",
                "lingua": "Pt",
                "resumo": "Phishing continua sendo um dos mais signiﬁcativos problemas de segurança da Internet, causando prejuízos ﬁnanceiros a organizações e usuários. Esse tipo de ataque combina engenharia social e outras técnicas soﬁsticadas com as quais o atacante tenta ludibriar a vítima para roubar informações pessoais desta. Usualmente, o combate ao phishing é feito com algumas das mesmas técnicas usadas no combate ao spam, como aquelas que focam em conjuntos de palavras e termos característicos. Entretanto há poucos trabalhos que tratam especiﬁcamente de phishing e há dúvidas sobre a estabilidade ou evolução de características das mensagens ao longo do tempo e sobre como elas podem ser exploradas para melhorar as defesas do sistema. Neste trabalho apresentamos um método adaptativo para identiﬁcação de mensagens de phishing e aplicamos este método em um grande conjunto de dados para identiﬁcar e caracterizar centenas de campanhas de phishing.",
                "link": ""
            },
            {
                "titulo": "A Selective Defense for Mitigating Coordinated Call Attacks",
                "paginas": 14,
                "autores": "Marcilio O. O. Lemos, Yuri Gil Dantas, Iguatemi E. Fonseca Vivek Nigam and Gustavo Sampaio",
                "universidade": "Federal University of Paraíba, Brazil Technische Universit¨at Darmstadt, Germany",
                "lingua": "En",
                "resumo": "Telephony Denial of Service (TDoS) attack is a form of Denial of Service (DoS) attack that targets telephone services, such as Voice over IP (VoIP), not allowing legitimate users to make calls. This paper proposes a new selective defense for mitigating a type of TDoS called Coordinated Call Attack where attackers simply call to each other exhausting the target VoIP server’s resources and denying service to legitimate users. Our defense builds on the defense SeVen for mitigating Application Layer DDoS attacks. We implemented and integrated SeVen in usual VoIP systems using the SIP protocol and carried out a number of experiments: without SeVen, less than 15% of users can access the target VoIP service, whereas with SeVen, around 90% of users can access the same service.",
                "link": ""
            },
            {
                "titulo": "Proteção de dados sensíveis através do isolamento de processos arbitrários no kernel Linux",
                "paginas": 16,
                "autores": "Otávio Augusto Silva, André Grégio, Paulo Lício de Geus",
                "universidade": "Instituto de Computação – Universidade Estadual de Campinas (Unicamp) Av. Albert Einstein, 1251 – 13083-852 – Campinas – SP – Brasil Centro de Tecnologia da Informação Renato Archer (CTI/MCTI) Rod. D. Pedro I (SP-65), KM 143,6 – 13069-901 – Campinas – SP – Brasil",
                "lingua": "Pt",
                "resumo": "As políticas de gerenciamento do Linux podem causar problemas, como decisões de segurança delegadas aos proprietários de um objeto. Mecanismos existentes tentam remedia-los via restrição de acesso a objetos de kernel e substituição deste por um mais seguro. Embora evitem alguns ataques, tais mecanismos não mitigam violações de privacidade, especialmente as que abusam a base de conﬁança do SO. Neste artigo, propõe-se um mecanismo que aplique regras pré-deﬁnidas em processos sensíveis cujo nível de conﬁança no SO não é suﬁciente e a quebra das regras não gere alertas de Mandatory Access Control. O módulo proposto intercepta a tabela de chamadas de sistema, usa o framework LSM e estende outras abordagens (AppArmor e Gresecurity).",
                "link": ""
            },
            {
                "titulo": "Reduzindo a Probabilidade de Colisões através do Encurtamento dos Slots em Redes 802.11",
                "paginas": 14,
                "autores": "Rafael Araújo da Silva, Aldri Luiz dos Santos, Michele Nogueira",
                "universidade": "Departamento de Informática – Universidade Federal do Paraná (UFPR)",
                "lingua": "Pt",
                "resumo": "Um dos principais desaﬁos das redes locais sem ﬁo da próxima geração é prover protocolos de acesso ao meio escaláveis para suportar a grande densidade estimada. Resultados de pesquisa indicam que o mecanismo de backoff atual é ineﬁcaz em ambientes de redes densas, ainda mais sob o esperado crescimento nesta carga para os próximos cinco anos. Este trabalho analisa a proposta de alargamento da janela de contenção através da redução da duração dos slots a ser implementada pela emenda 802.11ax. Nossa análise considera as diferentes classes de tráfego, reﬂetindo nas categorias de acesso para priorização de dados e suas respectivas janelas. Os resultados de simulação indicam que a proposta atenua o problema das colisões inerentes ao backoff e diminui a probabilidade de descartes de quadros. Nosso estudo demostra os benefícios que a mudança pode alcançar em termos de aumento da taxa de transferência e redução das retransmissões e, também, alerta para o impacto que pode ocorrer no processo de veriﬁcação do canal. Os resultados contribuem com a literatura assistindo no avanço das redes locais sem ﬁo da próxima geração.",
                "link": ""
            },
            {
                "titulo": "SDMA Group Selection for Reduced Computational Complexity on MU MIMO Systems",
                "paginas": 14,
                "autores": "Lászlon R. Costa, F. Rafael M. Lima, Tarcisio F. Maciel Yuri C. B. Silva, F. Rodrigo P. Cavalcanti",
                "universidade": "Telecomunnications Research Group (GTEL), Federal University of Ceará, Fortaleza, Brazil Programa de Pós-Graduação em Engenharia Elétrica e de Computação (PPGEEC), Federal University of Ceará, Sobral, Brazil",
                "lingua": "En",
                "resumo": "Optimizing wireless systems with Multiple Input Multiple Output (MIMO) by means of Radio Resource Allocation (RRA) in general requires very complex algorithms. In this work, we revisit two Radio Resource Allocation (RRA) problems in this scenario: Unconstrained Rate Maximization (URM) and Constrained Rate Maximization (CRM). In order to optimally solve those problems it is necessary to list all possible Space Division Multiple Access (SDMA) groups combinations and calculate the transmit and receive ﬁlters of the terminals for each combination. The main proposal in this work is to decrease the complexity of the RRA solutions at the cost of a controlled performance degradation by selecting only a fraction of all possible SDMA groups.",
                "link": ""
            },
            {
                "titulo": "Análise e solução para o problema da instabilidade de associação em redes IEEE 802.11 densas",
                "paginas": 16,
                "autores": "Helga Balbi, Diego Passos, Ricardo Carrano, Luiz Magalhaes Célio Albuquerque",
                "universidade": "Instituto de Computação – Universidade Federal Fluminense (UFF) – Niterói – RJ – Brazil Departamento de Engenharia de Telecomunicações – Universidade Federal Fluminense (UFF) – Niterói – RJ – Brazil",
                "lingua": "Pt",
                "resumo": "A decisão de realização ou não de handoff entre pontos de acesso em uma rede IEEE 802.11 infraestruturada é uma prerrogativa exclusiva das estações. Mesmo sem mobilidade, dispositivos clientes podem decidir migrar para um novo ponto de acesso com o objetivo de obter melhor desempenho. Entretanto, os critérios utilizados para a realização do handoff não são deﬁnidos no padrão IEEE 802.11, ﬁcando a cargo das implementações dos fabricantes. Neste trabalho, realizando-se experimentos e utilizando-se dados reais de uma rede sem ﬁo de larga escala implantada na Universidade Federal Fluminense (UFF), demonstra-se que tais implementações são comumente deﬁcientes, resultando em grande instabilidade de associação em ambientes densos. Através da análise da implementação mais comumente utilizada por clientes na rede Wi-Fi da UFF, concluiu-se que, esta instabilidade, denominada neste trabalho de “ping-pong”, resulta da utilização direta de amostras de RSSI que são altamente variáveis. Finalmente, propõe-se um processo simples de suavização da série temporal destas amostras. Experimentos realizados em uma rede real mostram que esta suavização efetivamente elimina o “ping-pong”. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 163",
                "link": ""
            },
            {
                "titulo": "Um Serviço de Detecção de Falhas com QoS Auto-Ajustável para Múltiplas Aplicações Simultâneas",
                "paginas": 14,
                "autores": "Rogério C. Turchetti, Elias P. Duarte Jr., Luciana Arantes, Pierre Sens",
                "universidade": "Departamento de Informática – Universidade Federal do Paraná (UFPR) Caixa Postal 19.081 – 81.531-980 – Curitiba – PR – Brasil CTISM - Universidade Federal de Santa Maria (UFSM) Avenida Roraima, 1000 – 97105-900 – Santa Maria – RS – Brasil Laboratoire d’Informatique de Paris 6 / Université Pierre et Marie Curie, Paris, France",
                "lingua": "Pt",
                "resumo": "Detectores de falhas monitoram os estados de processos de uma aplicação distribuída, efetuando hipóteses temporais sobre atrasos no sistema e disponibilizando informações sobre os estados destes processos. Neste trabalho é proposto o serviço de detecção de falhas denominado QoS-CFDS (Quality of Service-Conﬁgurable Failure Detection Service). O serviço QoS-CFDS é autoajustável, isto é, adapta seus parâmetros de monitoramento conforme as variações percebidas no ambiente e de acordo com as necessidades de cada aplicação. São propostas estratégias para ajustar a QoS do detector de acordo com os requisitos fornecidos por múltiplas aplicações simultâneas. Um protótipo do serviço proposto foi implementado com o protocolo SNMP e resultados experimentais são descritos para o desempenho do detector, incluindo os benefícios dos ajustes realizados para atender requisitos das aplicações simultaneamente.",
                "link": ""
            },
            {
                "titulo": "Timely hybrid synchronous virtual networks",
                "paginas": 14,
                "autores": "Rasha Hasan, Fernando Luís Dotti",
                "universidade": "Faculdade de Informática – Pontifícia Universidade Católica do Rio Grande do Sul Av. Ipiranga, 6681 Prédio 32 sala 505, Porto Alegre, Brazil",
                "lingua": "En",
                "resumo": "Network virtualization has been proposed in the last years, and it received special attention from both networking and distributed systems communities. However, speciﬁc applications’ requirements, such as topology, security, and resilience, pose different challenges to the network embedding problem. Among these requirements lays the one of synchrony, that some applications demand time bounds for processing and communication. In this sense, Hybrid Synchrony Virtual Networks (HSVN) has been proposed to fulﬁll speciﬁc synchrony requirements and better support a considerable class of distributed systems. In our previous works, we gave attention to “space” HSVNs that was addressed to support hybrid synchrony systems in space. In this work, analogously, we discuss hybrid synchrony virtual networks for the “time” dimension. We regard the time HSVNs abstractions and techniques as being a reﬁnement of the space HSVNs, since it further deﬁnes repeating time windows of synchrony while allowing the resource to behave asynchronously for a period of time. The timely hybrid model leads to the possibility of further sparing synchronous resources, if compared to the space model, as will be presented in this paper.",
                "link": ""
            },
            {
                "titulo": "Uma Estratégia Paralela e Autònoma para a Projeção de Modelos de Nicho Ecológico em Ambientes Computacionais Heterogêneos",
                "paginas": 16,
                "autores": "Fernanda G. O. Passos, Vinod E. F. Rebello",
                "universidade": "Instituto de Computação – Universidade Federal Fluminense (UFF) Niterói, RJ – Brasil.",
                "lingua": "Pt",
                "resumo": "A modelagem de nichos ecológicos (Ecological Niche Modelling – ENM) é um processo importante para ajudar ecologistas a entender e prever a distribuição geográﬁca potencial de espécies. Junto à criação de modelos correlativos para cada espécie, a projeção do modelo em um ambiente geográﬁco é um passo essencial neste processo. Devido à necessidade para melhorar a precisão e para tratar grandes domínios geoespaciais, tal método pode demandar níveis de processamento, memória e E/S, relativamente altos. Este artigo propõe um novo algoritmo paralelo e autònomo para a etapa de projeção de uma ferramenta ENM existente bastante utilizada em ambientes computacionais heterogêneos de larga escala. A proposta é comparada com a implementação sequencial padrão e uma versão paralela em MPI, ambas disponibilizadas com a ferramenta. Uma análise empírica indica ganhos em termos de desempenho acima de 170% em relação a versão MPI assim como uma melhor escalabilidade com eﬁciências acima de 80%, em testes com até 128 processadores.",
                "link": ""
            },
            {
                "titulo": "Um Modelo Híbrido para Entrega de Conteúdo em Redes Veiculares",
                "paginas": 14,
                "autores": "Fabrício A. Silva, Thais Regina M. B. Silva, Eduardo Cerqueira Linnyer B. Ruiz e Antonio A. F. Loureiro 1. Introdução",
                "universidade": "Instituto de Ciências Exatas e Tecnológicas (UFV-Florestal) Fac. Engenharia da Computação e Telecomunicações (UFPA) Departamento de Informática (UEM) Departamento de Ciência da Computação (UFMG) As redes veiculares são formadas pela comunicação entre veículos automotores, e entre veículos e unidades de acostamento (RSUs) [Campista et al. 2009]. As aplicações para esse tipo de rede têm evoluído de simples trocas de mensagens de alerta para sistemas avançados com demanda por entrega de variados conteúdos [Costa-Montenegro et al. 2012]. Essas aplicações emergentes requerem que conteúdos digitais heterogêneos sejam entre- gues aos veículos, incluindo notiﬁcações de trânsito, previsão de tempo, vídeos e imagens",
                "lingua": "Pt",
                "resumo": "As aplicações para redes veiculares estão surgindo com o objetivo de tornar o trânsito mais seguro, menos congestionado, mais informativo e prazeroso. Para isso, um dos principais requisitos de tais aplicações é a entrega eﬁciente de conteúdo aos veículos. Normalmente, duas abordagens têm sido usadas para a entrega de conteúdo em redes tradicionais: Redes de Entrega de Conteúdo (Content Delivery Networks ou simplesmente CDN) e Redes Par-aPar (P2P). Porém, as características especíﬁcas das redes veiculares sugerem que essas abordagens isoladas, como originalmente propostas para a Internet, não são adequadas para esse tipo de rede. Neste trabalho, é proposto um modelo híbrido em que conceitos de CDN e P2P são estendidos e adaptados para as redes veiculares. São deﬁnidos e descritos os principais componentes a serem implementados para o modelo proposto, que servem de base para projetistas de aplicações e serviços. Para concluir, é implementada uma solução para demonstrar a eﬁciência do modelo proposto em relação ao desempenho das aplicações. Abstract. Vehicular network applications are emerging to reality with the objective of making trafﬁc safer, less congested, more informative, and enjoyable. To this end, a fundamental requirement for such applications is the efﬁcient delivery of content. Usually, two approaches have been used to deliver content in the traditional Internet: Content Delivery Networks (CDN) and Peer-to-Peer (P2P). However, several characteristics of VANETs and their applications suggest that pure CDN and P2P models, as originally conceived for the Internet, are not suitable for them. In this work, we propose a hybrid model where concepts from both CDN and P2P are inherited and adapted to vehicular networks. We deﬁne and describe the main components to be implemented in the proposed model. Finally, we propose and evaluate a solution to demonstrate that the proposed model is useful for the performance of vehicular applications.",
                "link": ""
            },
            {
                "titulo": "CO-OP: Uma Solução para a Detecção, Classiﬁcação e Minimização de Congestionamentos de Veículos utilizando Roteamento Cooperativo",
                "paginas": 14,
                "autores": "Allan Mariano de Souza, Daniel Guidoni, Leonardo C. Botega e Leandro A. Villas",
                "universidade": "Instituto de Computação – UNICAMP",
                "lingua": "Pt",
                "resumo": "A maioria das cidades grandes sofrem com problema de congestionamento, uma das principais causas de congestionamento é o aumento do tráfego de veículos durante o horários de pico, principalmente em áreas com gargalos de infraestrutura. Existem soluções atuais na literatura baseadas em detecção nas condições de tráfego e em redirecionamento de veículos para evitar a áreas congestionadas. No entanto, essas soluções não consideram o impacto dessas mudanças nos próximso padrões de tráfego. Assim, essas abordagens são incapazes de fornecer uma solução de longo prazo para o problema do congestionamento, desde quando sugerindo rotas alternativas, criam novos gargalos em um futuro próximo, assim, apenas transferindo o problema de um ponto a outro. Com esta questão em mente, propomos uma solução cooperativa de roteamento chamado CO-OP, o qual melhora a utilização do espaço global e como consequencia reduz o tempo de viagem, evitando congestionamentos. Os resultados das simulações mostram que a nossa proposta é capaz controlar congestionamento e previnir o surgimento de congestionamentos em um futuro próximo. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 237",
                "link": ""
            },
            {
                "titulo": "RAN: Um Mecanismo para Tratar o Efeito de Sincronização no Padrão WAVE IEEE 802.11p",
                "paginas": 16,
                "autores": "Erick A. Donato, Edmundo R. M. Madeira, Leandro A. Villas",
                "universidade": "Instituto de Computação – UNICAMP",
                "lingua": "Pt",
                "resumo": "As redes veiculares se enquadram como a base principal para o desenvolvimento de sistemas de transporte inteligentes(ITS). Assim sendo, e no sentido de tirar proveito dos benefícios destes sistemas de transporte, tornouse necessário o desenvolvimento de padrões que levassem em consideração as características especíﬁcas das redes veiculares. O Wireless Access in Vehicular Environments (WAVE) foi desenvolvido como forma de proporcionar uma resposta a esta necessidade. Este padrão apresenta uma arquitetura baseada em múltiplos canais, que são deﬁnidos de acordo com os tipos de aplicações, e que utiliza um mecanismo de salto de canais para a seleção de canais considerando que em cada período de tempo um único canal estará ativo. No entanto, veriﬁcou-se que, em determinados cenários, essa abordagem de salto de canais introduz um efeito de sincronização indesejado, que permite que diferentes veículos transmitam ao mesmo tempo, resultando em colisões. Este trabalho propõe uma solução para este problema, com o desenvolvimento de um mecanismo baseado na atualização do atraso de transmissão que visa trabalhar em parceria com outros mecanismos como o de supressão de broadcast para garantir um maior desempenho nas transmissões.",
                "link": ""
            },
            {
                "titulo": "Sincronização de Arquivos entre Nuvens de Armazenamento e Repositórios Geograﬁcamente Distribuídos",
                "paginas": 14,
                "autores": "Gil Andriani, Guilherme Koslovski, Mauricio A. Pillon",
                "universidade": "Programa de Pós Graduação em Computação Aplicada (PPGCA) Universidade do Estado de Santa Catarina - UDESC - Joinville, SC - Brasil",
                "lingua": "Pt",
                "resumo": "Provedores de nuvens computacionais difundiram sistemas de armazenamento dinâmicos, entregues aos usuários ﬁnais como serviços acessíveis sobdemanda. Especiﬁcamente, o armazenamento de arquivos alcançou popularidade em ambientes domésticos. Entretanto, os requisitos de acesso, as expectativas de desempenho e as características de utilização são distintas para organizações, fato não considerado pelos aplicativos populares para sincronização de arquivos entre provedores e repositórios locais. Nesse contexto, esse artigo apresenta CHSAN, uma arquitetura para sincronização de arquivos entre armazenamento na nuvem e repositórios geograﬁcamente distribuídos. Os resultados experimentais indicam uma aplicação promissora em ambientes com usuários colaborativos geograﬁcamente distribuídos. Abstract. Cloud Computing providers had spread the dynamic storage provisioning, delivered to end users as on-demand services. Although ﬁle storage and share achieved popularity among domestic users, access requirements, performance expectations and usage characteristics are different for organizations, and were not originally considered by popular application for synchronizing ﬁles between providers and local repositories. In this context, this paper introduces CHSAN, an architecture for synchronizing ﬁles between cloud storage and repositories geographically distributed. The experimental results indicate a promising application in collaborative environments with geographically distributed users.",
                "link": ""
            },
            {
                "titulo": "Um SLA 3D para o Escalonamento Multiusuário Sobre Múltiplos Provedores de IaaS",
                "paginas": 14,
                "autores": "Cristiano C. A. Vieira, Luiz F. Bittencourt, Edmundo R. M. Madeira",
                "universidade": "Universidade de Campinas - Instituto de Computação Av. Albert Einstein, 1251 - Cidade Universitária, Campinas/SP - Brasil",
                "lingua": "Pt",
                "resumo": "Usuários de provedores de nuvens executam aplicações com diferentes necessidades de QoS. Contudo, o principal item tratado nos SLAs atualmente é o tempo de utilização e as implicações quanto a sua violação, negligenciando outros fatores importantes em um SLA. Para tratar esta questão, neste trabalho, introduzimos um SLA que considera três importantes aspectos de QoS: conﬁabilidade, desempenho e segurança. O objetivo é escalonar requisições de máquinas virtuais de múltiplos usuários em provedores públicos de IaaS obtendo o menor custo monetário sem violar a QoS das requisições. Apresentamos uma PLI e uma heurística para computar o escalonamento. Além disso, apresentamos e avaliamos os resultados experimentais obtidos a partir da implementação da nossa estratégia.",
                "link": ""
            },
            {
                "titulo": "LB-RLT Approach for Load Balancing Heterogeneous Storage Nodes",
                "paginas": 16,
                "autores": "Antonio M. R. Almeida, Denis M. Cavalcante, Flávio R. C. Sousa e Javam C. Machado",
                "universidade": "Mestrado e Doutorado em Ciencia da Computacao (MDCC) Universidade Federal do Ceará (UFC) – Fortaleza, CE – Brasil",
                "lingua": "En",
                "resumo": "Cloud computing is a paradigm of service-oriented computing and has changed the way computing infrastructure is abstracted and used. The cloud is composed by heterogeneous resources and has a variable workload. Thus, load balancing techniques are crucial to distribute workload to processing nodes for enhancing the overall system performance. Conventional algorithms for load balancing have limitations in this environment, or they do not consider speciﬁc aspects of the resources simultaneously, e.g., response time and throughput. To address these limitations, this paper presents an approach to load balancing in the cloud. This approach considers cloud infrastructure storage throughput and a heterogeneous storage nodes environment. In order to evaluate this approach, we have conducted experiments that measure the response time, throughput and success rate and compared our results against conventional algorithms. Experimental results conﬁrm that our approach ensures quality of service agreement, while using resources more efﬁciently.",
                "link": ""
            },
            {
                "titulo": "Uso de Aspectos da Topologia Virtual no Problema RWBA em Redes  Opticas Metropolitanas MB-OFDM",
                "paginas": 11,
                "autores": "Eduardo S. Gama, Iguatemi E. Fonseca, Carlos M. Araújo, Raul C. Almeida Júnior Tiago M. F. Alves, João P. F. Rosário, Adolfo V. T. Cartaxo",
                "universidade": "Centro de Informática – Universidade Federal da Paraíba (UFPB) João Pessoa - PB, Brasil Departamento de Eletrònica e Sistemas – Universidade Federal de Pernambuco (UFPE) Recife - PE, Brasil Instituto de Telecomunicações IST – Universidade de Lisboa 1049-001 Lisboa, Portugal",
                "lingua": "Pt",
                "resumo": "Este artigo trata do uso de aspectos do projeto de topologia virtual no problema de Alocação de Rota, Comprimento de Onda e Banda (RWBA - Routing, Wavelength and Band Assignment) em redes ópticas metropolitanas MBOFDM. A rede metropolitana MORFEUS considerada neste trabalho é uma rede de topologia em anel com enlaces bidirecionais. Dada uma requisição de conexão, o algoritmo RWBA deve atribuir uma rota, um comprimento de onda e um conjunto de bandas capazes de atendê-la. Na arquitetura da rede MORFEUS, cada nó ROADM (Reconﬁgurable Optical Add-Drop Multiplexer) é composto por componentes de multiplexação WDM e componentes de extração e inserção de banda MB-OFDM, chamados, respectivamente, de MEB (MORFEUS Extraction Block) e MIB (MORFEUS Insertion Block). Com isso um Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 311",
                "link": ""
            },
            {
                "titulo": "Um Novo Algoritmo RSA Ciente de Imperfeições de Camada Física para Redes  Opticas Elásticas",
                "paginas": 14,
                "autores": "Alexandre Fontinele, Iallen Santos, Juarez Nolêto Neto Divanilson R. Campelo e André Soares",
                "universidade": "Departamento de Computação Universidade Federal do Piauí (UFPI) Teresina – PI – Brasil Instituto Federal de Educação, Ciência e Tecnologia do Piauí (IFPI) São Raimundo Nonato – PI – Brasil Centro de Informática (CIn) Universidade Federal de Pernambuco (UFPE) Recife – PE – Brasil",
                "lingua": "Pt",
                "resumo": "Este artigo propõe um novo algoritmo de roteamento e alocação de espectro ciente dos efeitos de camada física para redes ópticas elásticas. O objetivo do algoritmo é reduzir a probabilidade de bloqueio causada pela degradação da qualidade de transmissão proveniente de novos estabelecimentos de circuitos. A nossa proposta é comparada com outros dois algoritmos Impairment-Aware Routing and Spectrum Assignment (IA-RSA): Modiﬁed Dijkstra Path Computation (MD-PC) e K-Shortest Path Computation (KS-PC). Resultados de simulação mostram que o algoritmo proposto apresenta um desempenho superior ao dos algoritmos MD-PC e KS-PC em termos de probabilidade de bloqueio de circuitos e probabilidade de bloqueio de banda para as topologias EON e NSFNet. Em geral, em termos de probabilidade de bloqueio de circuitos o algoritmo proposto apresenta um ganho mínimo de 78,10% e 55,75% quando comparado aos algoritmos KS-PC e MD-PC, respectivamente. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 322",
                "link": ""
            },
            {
                "titulo": "Proteção de Redes  Opticas Elásticas Baseada em Agregação de Tráfego, Sobreposição de Espectro e p-Cycle FIPP",
                "paginas": 16,
                "autores": "Helder M. N. da S. Oliveira, Nelson L. S. da Fonseca",
                "universidade": "Instituto de Computação – Universidade Estadual de Campinas (UNICAMP) Campinas 13083-852, SP, Brasil",
                "lingua": "Pt",
                "resumo": "Nos últimos anos, a tecnologia de redes ópticas elásticas tem emergido como uma solução para lidar com a diversidade de requisições de largura de banda das aplicações em rede. No entanto, falhas em enlaces e nós causam perdas maciça de dados, mesmo que por curtos períodos. Portanto, técnicas de proteção têm sido desenvolvidas para lidar com falhas. Entre essas técnicas, p-cycle é muito atraente, uma vez que a capacidade reservada é pré-conectada e que forma estruturas em anel para proteção de redes em malha. Este artigo apresenta um novo algoritmo para fornecer proteção de caminho através do emprego de p-cycle de caminho, agregação de tráfego e sobreposição de espectro em redes ópticas elásticas. O algoritmo proposto é comparado com outros algoritmos existentes na literatura. Os resultados indicam que o algoritmo proposto gera até 40 % menos bloqueio que os outros algoritmos na literatura.",
                "link": ""
            },
            {
                "titulo": "Aqui Todos Podem Publicar: Uma Abordagem Escalável para Controle de Acesso Muitos para Muitos em Redes Centradas em Informação",
                "paginas": 14,
                "autores": "Rafael Hansen da Silva, Weverton Luis da Costa Cordeiro, Luciano Paschoal Gaspary 1. Introdução",
                "universidade": "Instituto de Informática – Universidade Federal do Rio Grande do Sul (UFRGS) Caixa Postal 15.064 – 91.501-970 – Porto Alegre – RS – Brasil O paradigma de Redes Centradas em Informação ( emergiu como uma direção promissora para a Internet do Futuro [Xylomenos et al. 2014].",
                "lingua": "Pt",
                "resumo": "Um dos principais desaﬁos em Redes Centradas em Informação (ICN) é como prover controle de acesso à publicação e recuperação de conteúdos. Apesar das potencialidades, as soluções existentes geralmente consideram um único usuário agindo como publicador. Ao lidar com múltiplos publicadores, elas podem levar a uma explosão combinatória de chaves criptográﬁcas. As soluções projetadas visando aos múltiplos publicadores, porém, dependem de arquiteturas de rede especíﬁcas e/ou de mudanças na mesma para operar. Neste artigo é proposta uma solução, apoiada em criptograﬁa baseada em atributos, para controle de acesso a conteúdos. Nessa solução, o modelo de segurança é voltado a grupos de compartilhamento seguro, nos quais todos os usuários membros podem publicar e consumir conteúdos. Diferente de trabalhos anteriores, a solução proposta mantém o número de chaves proporcional ao de membros nos grupos e pode ser empregada em qualquer arquitetura ICN de forma gradual. A proposta é avaliada quanto ao custo de operação, à quantidade de chaves necessárias, e à eﬁciência na disseminação de conteúdos. Em comparação às soluções existentes, ela oferece maior ﬂexibilidade no controle de acesso, sem aumentar a complexidade do gerenciamento de chaves e sem causar sobrecustos signiﬁcativos à rede. Abstract. One of the main challenges in Information Centric Networks (ICN) is providing access control to content publication and retrieval. In spite of the potentialities, existing solutions often consider a single user acting as publisher. When dealing with multiple publishers, they may lead to a combinatorial explosion of cryptographic keys. Those solutions that focus on multiple publishers, on the other hand, rely on speciﬁc network architectures and/or changes to operate. In this paper we propose a solution, supported by attribute-based encryption, for content access control. In this solution, the security model is focused on secure content distribution groups, in which any member user can publish to and retrieve from. Unlike previous work, the proposed solution keeps the number of cryptographic keys proportional to the number of group members, and may even be adopted gradually in any ICN architecture. The proposed solution is evaluated with respect to the overhead it imposes, number of required keys, and efﬁciency of content dissemination. In contrast to existing solutions, it offers higher access control ﬂexibility, without increasing key management process complexity or causing signiﬁcant network overhead.",
                "link": ""
            },
            {
                "titulo": "Q-caching: an integrated reinforcement-learning approach for caching and routing in information-centric networks",
                "paginas": 14,
                "autores": "Wouter Caarls, Eduardo Hargreaves, Daniel S. Menasché",
                "universidade": "Universidade Federal do Rio de Janeiro (UFRJ) Av. Athos da Silveira Ramos, 149 - Blc C - 21.941-909 Rio de Janeiro, Brasil",
                "lingua": "En",
                "resumo": "Content delivery, such as video streaming, is one of the most prevalent Internet applications. Although very popular, the continuous growth of such applications poses novel performance and scalability challenges. Informationcentric networks put content at the center, and propose novel solutions to such challenges but also pose new questions on the interface between caching and routing. In this paper, building on top of Q-routing we propose a caching strategy, namely Q-caching, which leverages information that is already collected by the routing algorithm. Q-caching promotes content diversity in the network, reducing the load at custodians and average download times for clients. In stylized topologies, we show that the gains of Q-caching against state-of-theart algorithms are signiﬁcant. We then consider the RNP topology, and show that Q-caching performance is more ﬂexible while competitive when compared against existing algorithms.",
                "link": ""
            },
            {
                "titulo": "Uma Estratégia de Cache baseada em Múltiplas Métricas para Redes ICN",
                "paginas": 16,
                "autores": "Igor Carvalho, Airton Ishimori, Antònio Abelém",
                "universidade": "Grupo de Estudos em Redes e Comunicação Multimídia – GERCOM Universidade Federal do Pará (UFPA) Belém – PA – Brasil",
                "lingua": "Pt",
                "resumo": "As Redes Centradas em Conteúdo (Information Centric Networks ICN ) são um paradigma de arquitetura de rede que atraiu muitas pesquisas nos últimos anos. O cache em rede permite que roteadores possam armazenar tal conteúdo, os quais utilizam-se de uma estratégia para decidir se armazenam-no ou não. Porém, a maioria das estratégias são baseadas em apenas uma métrica o que, levando em consideração a dinamicidade da rede, pode resultar em uma baixa taxa de acertos e desempenho da rede. Desta forma, este artigo propõe uma estratégia de decisão de cache baseado em múltiplas métricas para redes ICN, no qual usamos três métricas para selecionar os nós alvos e, com isso, melhor distribuir o conteúdo na rede. Nossos resultados obtiveram uma taxa de acertos bem maior que as outras propostas avaliadas e um tempo de download razoável.",
                "link": ""
            },
            {
                "titulo": "Análise da Estabilidade de Ranqueamento de Grau na Rede de Sistemas Autònomos da Internet",
                "paginas": 14,
                "autores": "Fernando F. Machado, Daniel R. Figueiredo, Miguel Elias M. Campista",
                "universidade": "GTA/PEE-COPPE/DEL-Poli - Universidade Federal do Rio de Janeiro (UFRJ) Rio de Janeiro - RJ - Brasil LAND/PESC-COPPE - Universidade Federal do Rio de Janeiro (UFRJ) Rio de Janeiro - RJ - Brasil",
                "lingua": "Pt",
                "resumo": "Muitas redes possuem propriedades que tendem a se manter ao longo do tempo, mesmo havendo grande variação na quantidade de vértices e arestas. Uma dessas propriedades é a estabilidade do ranqueamento dos principais vértices que pode ser avaliada através dos dados históricos da rede. Neste trabalho, técnicas anteriormente desenvolvidas são utilizadas como base para a análise da estabilidade temporal do ranqueamento de grau da rede de sistemas autònomos da Internet. Adicionalmente, uma análise empírica é proposta para avaliar a inﬂuência de fatores externos à estrutura dessa rede. Os resultados mostram que a estabilidade das posições do topo é predominantemente afetada pelos fatores externos, enquanto que as demais posições são também afetadas pelas variações de grau regulares da rede. Apesar da rede de sistemas autònomos ter sido analisada sob muitos aspectos, este trabalho é o primeiro a avaliar a dinâmica temporal do ranqueamento.",
                "link": ""
            },
            {
                "titulo": "Aplicando Redes Deﬁnidas por Software à gerência de um ponto de troca de tráfego (IX.br)",
                "paginas": 14,
                "autores": "Luis Felipe Cunha Martins, Dorgival Guedes 1. Introdução",
                "universidade": "Departamento de Ciência da Computação Universidade Federal de Minas Gerais O grande crescimento e aceitação da Internet possibilitou inúmeros benefícios e inovações, incorporando diversas áreas do conhecimento. No entanto, não eram espe- radas essa forte adesão e crescente utilização. Com isso, surgiram diversos problemas relativos à segurança, infraestrutura, topologia e comunicação. Para reduzir esses pro- blemas, os pontos de troca de tráfego (IX) surgiram como parte da infraestrutura da In- ternet, representando um ponto neutro, central, interconectando redes de diversos Siste- mas Autònomos (SA) que a constituem e permitindo uma melhor organização da rede,",
                "lingua": "Pt",
                "resumo": "Pontos de troca de tráfego Internet (IX) permitem que diferentes organizações se interliguem para trocar tráfego diretamente em uma certa localidade, visando a reduzir custos com provedores de mais alto nível. Sua operação é uma tarefa complexa e crítica, pelo volume de tráfego presente e pelos interesses comerciais envolvidos. Algumas propostas de utilização do paradigma de Redes Deﬁnidas por Software (SDN) no ambiente do IX já foram feitas, mas sem atentar para os desaﬁos operacionais internos dessas instalações. Com base nessa observação, este trabalho tem por objetivo descrever como o princípio de SDN pode ser aplicado internamente a um IX e demonstrar as vantagens desse paradigma do ponto de vista do operador do IX. Tarefas, que em alguns casos podem envolver dezenas de comandos de conﬁguração em diferentes dispositivos, podem ser simpliﬁcadas para algumas linhas de conﬁguração de um controlador SDN. A solução proposta foi desenvolvida com base no IX Minas Gerais, do projeto PTTMetro (IX.br), e considerando características dos diversos pontos em operação no país. Abstract. Internet trafﬁc exchange points (IX) allow different organizations to interconnect and exchange trafﬁc directly in a certain location, to reduce costs with upstream providers. Their operation is a complex and critical task, due to the volume of trafﬁc present and the comercial interests in play. Some proposals for the use of Software Deﬁned Networks (SDN) in this context have been made, but no attention has been given to the operational challenges in the IX themselves. Based on that observation, this work describes how the SDN paradigm can be applied in an IX and shows the advantages of that approach from the IX operator’s point of view. Some tasks that may require tens of conﬁguration commands in different devices to accomplish can be simpliﬁed to a few conﬁguration lines in an SDN controller. The proposed solution was developed based on the operation of the Minas Gerais IX, part of the PTTMetro project (IX.br), considering the characteristics of the various points in operation in Brazil.",
                "link": ""
            },
            {
                "titulo": "Delivering Application-Layer Trafﬁc Optimization Services based on Public Routing Data at Internet eXchange Points",
                "paginas": 16,
                "autores": "Danny Alex Lachos Perez, Samuel Henrique Bucke Brito Ramon dos Reis Fontes, Christian Esteve Rothenberg",
                "universidade": "Universidade Estadual de Campinas (UNICAMP) Faculdade de Engenharia Elétrica e de Computação (FEEC) Information & Networking Technologies Research & Innovation Group (INTRIG) Av Albert Einstein, 400, Cidade Universitária Zeferino Vaz, Campinas, SP, Brasil",
                "lingua": "En",
                "resumo": "Application-Layer Trafﬁc Optimization (ALTO) is a recently standardized protocol that provides abstract network topology and cost maps in addition to endpoint information services that can be consumed by applications in order to become network-aware and take optimized decisions regarding trafﬁc ﬂows. In this paper, we propose a public service based on the ALTO speciﬁcation using public routing information available at the Brazilian Internet eXchange Points (IXPs). Our ALTO server prototype takes the acronym of AaaS (ALTO-as-a-Service) and is based on over 2.5GB of real BGP data from the 25 Brazilian IX.br public IXPs. We evaluate our proposal in terms of functional behaviour and performance via proof of concept experiments which point to the potential beneﬁts of applications being able to take smart endpoint selection decisions when consuming the developer-friendly ALTO APIs.",
                "link": ""
            },
            {
                "titulo": "ESTRAT  EGIA DE ADAPTAC¸  AO DE FLUXO DE V IDEO BASEADO EM FATORES DE QoE",
                "paginas": 14,
                "autores": "Maiara de S. Coelho, César A. V. Melo",
                "universidade": "Instituto de Computação – Universidade Federal do Amazonas (UFAM) Caixa Postal 69077-000 – Manaus – AM – Brasil",
                "lingua": "Pt",
                "resumo": "A ampla adoção do Streaming Adaptativo sobre HTTP tem motivado estudos relacionados as técnicas de distribuição de conteúdo multimídia na Internet. Apesar da grande quantidade de estudos, poucos exploram cenários de compartilhamento da rede entre clientes, e o acoplamento entre a lógica de adaptação e o versionamento do conteúdo. Neste artigo apresenta-se uma estratégia de distribuição de conteúdo usando DASH que considera aspectos do versionamento na lógica de adaptação. Além disso, as decisões tomadas, para a adaptação do conteúdo as condições da rede, consideram fatores que afetam a Qualidade de Experiência do usuário. A estratégia proposta melhora a continuidade da sessão. Avaliou-se o desempenho da estratégia, considerando-se: número e duração das interrupções, taxa média de bits, instabilidade e injustiça, em diferentes cenários de rede, caracterizados pelo compartilhamento do canal de acesso por vários clientes.",
                "link": ""
            },
            {
                "titulo": "A Rede tem a Resposta: Um Modelo Escalável para Predição Integrada de Qualidade de Vídeo e QoE em Redes IP",
                "paginas": 14,
                "autores": "Roberto Irajá Tavares da Costa Filho, William Lautenschläger Hugo Schroter Lazzari, Valter Roesler, Luciano Paschoal Gaspary",
                "universidade": "Instituto de Informática – Universidade Federal do Rio Grande do Sul (UFRGS) Caixa Postal 15.064 – 91.501-970 – Porto Alegre – RS – Brazil",
                "lingua": "Pt",
                "resumo": "Pelo fato de streaming de vídeo representar aplicação \"matadora\"e por competitividade, provedores de serviços de telecomunicações precisam ser capazes de responder uma pergunta fundamental: em que medida a infraestrutura de rede disponível tem dado conta de oferecer aos usuários uma percepção de qualidade satisfatória quando empregam essas aplicações? Obter resposta a essa pergunta está longe de ser trivial, pois as técnicas existentes ou não são escaláveis ou são pouco acuradas. Para suprir essa lacuna, propõe-se um modelo de predição de qualidade de streaming de vídeo com base na observação de desempenho da rede IP subjacente. Para tal, o modelo proposto — criado usando redes LTE como estudo de caso — lança mão de técnica de medições ativas de baixo consumo de banda e de aprendizagem de máquina. Os resultados alcançados evidenciam que a solução proposta produz estimativas acuradas (erro médio abaixo de 10%) e apresenta intrusividade cerca de vinte vezes menor que técnicas tradicionais.",
                "link": ""
            },
            {
                "titulo": "Caracterização do Comportamento dos Clientes de Vídeo ao Vivo Durante um Evento de Larga Escala",
                "paginas": 16,
                "autores": "Breno Santos Gustavo Carnivali Wagner Almeida Alex B. Vieira Ítalo Cunha Jussara Almeida 1. Introdução",
                "universidade": "Departamento de Ciência da Computação, Universidade Federal de Juiz de Fora Departamento de Ciência da Computação, Universidade Federal de Minas Gerais Instituto Federal do Sudeste de Minas Gerais Eventos em larga escala são uma realidade cada vez mais comum na Internet. De fato, desde o discurso de posse de Obama , provedores de serviços estão sujeitos a surtos no número de clientes. Infelizmente, os provedores de serviços são incapazes de pre- ver com precisão a demanda desses eventos, particularmente para eventos esporádicos ou únicos, frequentemente subestimando ou superestimando a demanda. Provedores de serviço transmitem conteúdo de infraestruturas baseadas em nuvem (como centros de pro- cessamento de dados ou redes de distribuição de conteúdo) [Barroso et al. 2013]. Neste",
                "lingua": "Pt",
                "resumo": "Eventos de larga escala na Internet não mais são exceções. Entretanto, tanto pesquisadores quanto provedores de serviço ainda têm visão e entendimento limitados sobre tais eventos. Neste artigo, nós caracterizamos o comportamento dos usuários de um sistema de vídeo ao vivo durante um grande evento na Internet, a copa do mundo de futebol da FIFA em 2014. Analisamos dados relativos à transmissão de 64 partidas por um dos principais provedores de conteúdo Internet do Brasil. Nós identiﬁcamos as principais características do comportamento de um cliente e propomos um modelo simples que captura seu comportamento típico. Nossos resultados são comparados ao estado da arte e indicam mudanças no comportamento dos clientes durante eventos de larga escala na Internet. Acreditamos que nossos resultados podem ser aplicados na geração de cargas sintéticas realistas e servir como substrato para o desenvolvimento e avaliação de novas arquiteturas de transmissão ao vivo na Internet.",
                "link": ""
            },
            {
                "titulo": "Supporting Dynamic Reconfiguration in Distributed Data  Stream Systems",
                "paginas": 14,
                "autores": "",
                "universidade": "",
                "lingua": "En",
                "resumo": "The design and development of adaptive systems brings new  challenges since the dynamism of such systems is a multifaceted concern that  ranges from mechanisms to enable the adaptation on the software level to the  (self-) management of the entire system using adaptation policies or system  administrators, for instance. Data stream processing is one example of system  that requires dynamic reconfiguration. While dynamic reconfiguration is a  desirable feature, stream systems may suffer with the disruption and overhead  caused by the reconfiguration. In this paper, we propose and validate a nondisruptive reconfiguration approach for distributed data stream systems that  support stateful components and intermittent connections. We present  experimental evidence that our mechanism supports safe distributed  reconfiguration and has negligible impact on availability and performance.",
                "link": ""
            },
            {
                "titulo": "Replicação de Máquina de Estado Baseada em Prioridade com PRaft",
                "paginas": 14,
                "autores": "Paulo R. Pinho, Luciana de Oliveira Rech, Lau Cheuk Lung Miguel Correia, Lásaro Jonas Camargos",
                "universidade": "Departamento de Informática e Estatística, Universidade Fedral de Santa Catarina, Brasil",
                "lingua": "Pt",
                "resumo": "Replicação de máquina de estado é uma abordagem para criar serviços distribuídos tolerantes a faltas. O sistema se mantém correto enquanto tolera a falta de algumas de suas réplicas. Essas réplicas devem executar a mesma sequência de requisições, problema que é resolvido por algoritmos de ordem total como o Raft. Alguns serviços podem precisar que as requisições tenha diferentes níveis de prioridade, para que umas sejam executadas antes de outras. Neste trabalho propõe-se um algoritmo, PRaft, que introduz a ideia de replicação de máquina de estado baseado em prioridades ao Raft, modiﬁcandoo para considerar a prioridades das requisições.",
                "link": ""
            },
            {
                "titulo": "Redução de Tráfego de Jogos Distribuídos Através da Predição de Movimento Baseada em Aprendizado de Máquina",
                "paginas": 16,
                "autores": "Pâmela de Assis Beltrani, Aurora T. R. Pozo, Elias P. Duarte Jr.",
                "universidade": "Departamento de Informática – Universidade Federal do Paraná (UFPR) Curitiba – PR – Brasil",
                "lingua": "Pt",
                "resumo": "Em jogos distribuídos multiplayer os jogadores mantém uma visão consistente das posições uns dos outros através da troca periódica de mensagens. As mensagens de atualização, além de poderem sofrer atrasos de entrega que causam inconsistências na renderização, representam uma sobrecarga na rede. Estratégias de predição de movimento, como o tradicional algoritmo Dead Reckoning, evitam a troca de mensagens quando acertam. Neste trabalho, apresentamos uma nova estratégia para a predição de movimento baseada em aprendizado de máquina. A estratégia consiste de duas fases. Na primeira, um modelo de aprendizado classiﬁca se o Dead Reckoning acerta ou erra. Em caso de erro é utilizado um outro modelo de aprendizado para prever a nova posição. A estratégia proposta foi aplicada para o jogo World of Warcraft. Para a avaliação, os modelos de aprendizado foram implementados na ferramenta Weka. Foram utilizados dados de traces reais do jogo. Resultados mostram que a redução de tráfego foi de 66,41% em média, superior a outras abordagens.",
                "link": ""
            },
            {
                "titulo": "Roteamento Multicaminhos em Redes Deﬁnidas por Software",
                "paginas": 14,
                "autores": "Pedro H.A. Rezende, Luís F. Faina, Lásaro Camargos e Rafael Pasquini",
                "universidade": "Faculdade de Computação (FACOM) – Universidade Federal de Uberlândia (UFU) Caixa Postal 593 – 38.408-100 – Uberlândia – MG – Brazil",
                "lingua": "Pt",
                "resumo": "Este artigo apresenta e avalia um mecanismo para suportar roteamento multicaminhos em Redes Deﬁnidas por Software (SDN) OpenFlow. Utilizando informações do monitoramento de vazão e atraso para ﬂuxos, tendo por base consultas explícitas a contadores OpenFlow mantidos nos elementos de rede, o modulo proposto de multicaminhos é capaz de ramiﬁcar ﬂuxos na rede, de tal forma a atender demandas de largura de banda. O mecanismo multicaminhos proposto, diferentemente do MPTCP (MultiPath TCP), não requer nenhuma atualização na pilha de protocolos existente nos sistemas ﬁnais. Por ser uma solução desenvolvida diretamente no controlador OpenFlow, é capaz de tratar qualquer ﬂuxo utilizando a rede. Os resultados apresentados neste artigo demonstram o funcionamento do mecanismo de multicaminhos, evidenciando o comportamento da solução frente a existência ou não de tráfego concorrente através dos enlaces compondo a rede. Abstract. This paper presents and evaluates a mechanism to provide multipath routing in OpenFlow Software Deﬁned Networks. Based on monitoring information regarding throughput and ﬂow latency, gathered from a polling mechanism which reads counters maintained at OpenFlow network elements, the proposed multipath module is capable of splitting ﬂows across disjoint paths in the network, in order to satisfy bandwidth demands. The proposed multipath module, differently from MultiPath TCP, does not require changes in the protocol stack of end-hosts. Once such solution is completely developed in an OpenFlow controller, it is able to handle any ﬂow using the network. This paper details the multipath module workings, highlighting its behavior in the presence or absence of concurrent trafﬁc in the links composing the network.",
                "link": ""
            },
            {
                "titulo": "Contando os Segundos: Avaliação de Estratégias de Domínio Temporal para a Gerência de Regras em Redes SDN",
                "paginas": 14,
                "autores": "Miguel Neves, Rodrigo Oliveira, Fabrício Mazzola, Daniel Marcon, Luciano Gaspary, Marinho Barcellos",
                "universidade": "Instituto de Informática – Universidade Federal do Rio Grande do Sul (UFRGS) Caixa Postal 15.064 – 91.501-970 – Porto Alegre – RS – Brasil",
                "lingua": "Pt",
                "resumo": "As Redes Deﬁnidas por Software (SDN) permitem aos administradores de rede um melhor controle sobre o tráfego de dados. Entretanto, tal vantagem requer um aumento do número de regras de encaminhamento a serem instaladas nas tabelas de ﬂuxos de switches e roteadores, acarretando escassez de recursos e menor desempenho. Propostas recentes tentam fazer melhor uso das tabelas através da otimização do tempo que cada regra permanece instalada. Neste artigo, apresentamos uma avaliação qualitativa e quantitativa abrangente sobre as principais estratégias presentes no estado-da-arte. Primeiramente, identiﬁcamos os seus princípios e determinamos o espaço de projeto associado. Em seguida, realizamos extensas avaliações experimentais a ﬁm de mostrar os seus benefícios e limitações. Resultados indicam que o desempenho dos métodos atuais está distante do comportamento ótimo e também depende fortemente de uma parametrização precisa. As conclusões obtidas servem de base para o desenvolvimento de estratégias mais robustas, que possam tratar as limitações encontradas na literatura.",
                "link": ""
            },
            {
                "titulo": "REUNI: Um algoritmo para REduzir tabelas de encaminhamento e UNIformizar a distribuição dos ﬂuxos em redes com topologia hipercubo",
                "paginas": 16,
                "autores": "Dione S. A. Lima, Rafael S. Guimarães, Alextian B. Liberato Eros Spalla, Gilmar L. Vassoler, Magnos Martinello, Rodolfo S. Villaça",
                "universidade": "Núcleo de Estudos em Redes Deﬁnidas por Software (NERDS) Programa de Pós-Graduação em Informática (PPGI) Universidade Federal do Espírito Santo (UFES) – Vitória/ES Instituto Federal de Educação, Ciência e Tecnologia do Espírito Santo (IFES) Campus Cachoeiro/ES, Colatina/ES, Aracruz/ES, Serra/ES – Brazil",
                "lingua": "Pt",
                "resumo": "Uma possível topologia de interligação dos servidores em um Data Center é o hipercubo. Nele, o encaminhamento de pacotes é normalmente baseado em operações de XOR e é bastante eﬁciente, porém só funciona na ausência de falhas de nós ou enlaces no hipercubo. O uso de SDN e do protocolo OpenFlow pode ser uma alternativa para garantir o encaminhamento de tráfego nessas situações. Entretanto, a adoção de tabelas de encaminhamento em um hipercubo possui um alto custo, relacionado ao grande número de entradas nessas tabelas, que crescem em escala exponencial. Nesse contexto, este artigo apresenta o REUNI, um algoritmo para redução do número de entradas dessas tabelas com taxa de compactação logarítmica, proporcional ao número ∗Este trabalho tem recebido ﬁnanciamento do projeto Horizon 2020 da União Européia para pesquisa, desenvolvimento tecnológico e demonstração sob no. 688941 (FUTEBOL), assim como do Ministério Brasileiro da Ciência, Tecnologia e Inovação (MCTI) por meio da RNP e do CTIC. Além disso, gostaríamos de agradecer o ﬁnanciamento do CNPq sob no. 456143/2014-9 e 449369/20145, e da FAPES sob no. 524/2015. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 556",
                "link": ""
            },
            {
                "titulo": "Um Sistema Acurado de Detecção de Ameaças em Tempo Real por Processamento de Fluxos",
                "paginas": 14,
                "autores": "Antonio Gonzalez Pastana Lobato, Martin Andreoni Lopez, Otto Carlos Muniz Bandeira Duarte",
                "universidade": "Grupo de Teleinformática e Automação – GTA Universidade Federal do Rio de Janeiro – UFRJ Rio de Janeiro – RJ – Brasil",
                "lingua": "Pt",
                "resumo": "A detecção tardia de ameaças provoca o aumento substancial dos riscos de danos irreparáveis e inviabiliza qualquer tentativa de defesa. Embora sejam difíceis de serem descobertos, os ataques deixam vestígios que podem ser detectados. Este artigo propõe um sistema de detecção de ameaças em tempo real por processamento de ﬂuxos baseado em algoritmos de aprendizado de máquinas. A arquitetura do sistema combina as vantagens do processamento em tempo real de ﬂuxos com as do processamento em lotes sobre uma base histórica e não requer a intervenção de especialistas de segurança para a análise e readaptações às ameaças. O sistema proposto permite tanto a detecção de ataques conhecidos quanto de novos ataques, ainda desconhecidos, através de métodos automatizados de classiﬁcação de ataques e de detecção de anomalias. O sistema foi desenvolvido e avaliado a partir de um conjunto de dados construído com a captura de tráfego de rede legítimo e malicioso. Os resultados mostram que o sistema apresenta uma acurada detecção de ameaças com baixo tempo de processamento, o que possibilita estratégias de defesa.",
                "link": ""
            },
            {
                "titulo": "A Collaboration Model to Recommend Network Security Alerts Based on the Mixed Hybrid Approach",
                "paginas": 14,
                "autores": "Arthur de Moura Del Esposte, Rodrigo Campiolo, Fabio Kon, Daniel Batista",
                "universidade": "Instituto de Matemática e Estatística – Universidade de São Paulo (IME-USP) Rua do Matão, 1010 – 05508-090 – Cidade Universitária – São Paulo – SP – Brasil Universidade Tecnológica Federal do Paraná (UTFPR) - Campo Mourão - PR - Brasil",
                "lingua": "En",
                "resumo": "A high number of cyber security alerts are shared every second in different medias like forums, mail lists, and online social networks. The ﬂood of alerts complicates the network administrator’s job, since not all cyber security alerts are important for his/her speciﬁc environment. Thus, recommender system techniques could be properly used to ﬁlter cyber security alerts based on network administrator ratings and preferences. This paper presents a collaboration model to recommend cyber security alerts for network administrators, helping them to focus on the relevant alerts. To evaluate the model, an ofﬂine experiment is executed. Partial results showed that our model can be used to recommend cyber security alerts.",
                "link": ""
            },
            {
                "titulo": "Abordagem autonòmica para mitigar ciberataques em LANs",
                "paginas": 16,
                "autores": "Luiz Arthur Feitosa dos Santos, Rodrigo Campiolo Wagner Aparecido Monteverde, Daniel Macêdo Batista",
                "universidade": "Dept. Acad. Ciência da Computação – Universidade Tecnológica Federal do Paraná Instituto de Matemática e Estatística – Universidade de São Paulo",
                "lingua": "Pt",
                "resumo": "Lidar com ciberataques em LANs tem se tornado uma árdua tarefa para o ser humano, principalmente devido a agregação crescente de usuários e dispositivos heterogêneos incentivada por práticas como BYOD, que trazem constantemente novas ameaças à segurança das LANs. Assim, propomos uma abordagem que emprega aprendizagem de máquina para processar, similarmente à memória humana, históricos de uso da rede e alertas de segurança, para extrair regras de segurança que são aplicadas autonomicamente na rede, por intermédio da tecnologia OpenFlow. Em ambiente simulado, a abordagem proposta foi capaz de mitigar 97,3% dos pacotes maliciosos em ataques DDoS TCP-SYN, já em uma rede real ajudou a mitigar 44 tipos de ciberameaças.",
                "link": ""
            },
            {
                "titulo": "Agregação de Dados com Desvio de Buracos para Redes de Sensores Sem Fio com  Sinks  de Alto Alcance",
                "paginas": 14,
                "autores": "Moysés M. Lima, Horácio A. B. F. de Oliveira, Eduardo F. Nakamura Raimundo Barreto e Daniel L. Guidoni",
                "universidade": "Instituto de Computação – Universidade Federal do Amazonas Departamento de Computação – Pontifícia Universidade Católica de Minas Gerais",
                "lingua": "Pt",
                "resumo": "Em Redes de Sensores sem Fio (RSSFs), a técnica de encaminhamento guloso é bastante utilizada pela maioria dos algoritmos de roteamento geográﬁco. A abordagem utiliza a informação de localização dos vizinhos para escolher o próximo salto, geograﬁcamente mais próximo do destino. No entanto, a estratégia requer a utilização prévia de um sistema de localização, que nem sempre está disponível em cenários de ﬂoresta e na maioria dos casos não é capaz de lidar com buracos. Neste trabalho, desenvolvemos um algoritmo de roteamento geográﬁco que realiza agregação de dados e é capaz de desviar buracos de roteamento em RSSFs. Nossa abordagem, chamada ARESTA, utiliza um sink com alto alcance de comunicação que envia um pacote de anúncio a toda rede em um único salto. O algoritmo ARESTA é capaz de lidar com buracos de roteamento por meio de uma nova técnica que utiliza o RSSI (Received Signal Strength Indicator) dos nós para detectar e desviar buracos. Os valores do RSSI divulgados pelo nó sink de longo alcance são utilizados para criar um temporizador que auxilia na agregação de dados. As simulações realizadas mostram uma eﬁciente taxa de entrega, escalabilidade em redes densamente populadas, além de identiﬁcar e detectar buracos mantendo os benefícios de algoritmos de encaminhamento guloso. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 616",
                "link": ""
            },
            {
                "titulo": "A Distributed Coverage Node Scheduling Algorithm for Dense Wireless Sensor Networks",
                "paginas": 14,
                "autores": "Daniel R. Matos, Gabriel A. L. Paillard, Miguel F. de Castro",
                "universidade": "Departamento de Computação – Universidade Federal do Ceará (UFC) Campus do Pici, bloco 910 – 60.440-900 – Fortaleza – CE – Brazil Instituto Universidade Virtual – Universidade Federal do Ceará (UFC) Av. Humberto Monte, s/n, bloco 901, Campus do Pici 60.440-554 – Fortaleza – CE – Brazil",
                "lingua": "En",
                "resumo": "Wireless Sensor Networks (WSNs) have remarkable application potentials: smart homes, environment monitoring, health care, and a myriad of other commercial areas. In general, WSNs operate under severe energy constraints: a typical sensor’s battery is irreplaceable and its lifetime is limited. Moreover, those tiny sensor nodes usually have extremely limited physical capabilities as well. Consequently, sensor deployments with reasonable densities are fundamental in order to prolong the lifetime of the networks. Distributing sensors randomly can lead to a redundancy on some areas and this is desirable to overcome the failures of some sensors. In this work, we propose a distributed algorithm to schedule active sensors to both reduce the redundancy of data obtained by the network and prolong its lifetime. Experimental evaluation shows that our approach guarantees a coverage rate around 99.9%.",
                "link": ""
            },
            {
                "titulo": "ALABAMO: A LoAd BAlancing MOdel for RPL",
                "paginas": 16,
                "autores": "Tarcisio Bruno Oliveira, Pedro Henrique Gomes Danielo G. Gomes, Bhaskar Krishnamachari",
                "universidade": "Grupo de Redes de Computadores, Engenharia de Software e Sistemas (GREat) Departamento de Engenharia de Teleinformática – Universidade Federal do Ceará (UFC) Fortaleza – CE – Brazil Autonomous Networks Research Group (ANRG) Ming Hsieh Department of Electrical Engineering – University of Southern California (USC) Los Angeles – CA – USA",
                "lingua": "En",
                "resumo": "Most of the nodes that compose the Internet of Things (IoT) are battery-operated, which makes energy efﬁciency a critical goal. However, more important than simply saving energy is consuming energy uniformly among the nodes. Imbalanced energy consumption may disrupt the network (energy hole problem). We present a solution that solves the network load balance problem; it is based on the RPL protocol, making it suitable for dynamic environments and compliant with standard network stack for IoT devices. The proposal was implemented in ContikiOS and tested in a real 41-node testbed using TelosB motes. Network lifetime had a 2-fold increase compared to the default RPL implementation. We also reduced the standard deviation of consumption by 50.64%, which indicates that nodes spend energy homogeneously, thus extending the lifetime of most of the nodes.",
                "link": ""
            },
            {
                "titulo": "Escalonamento de processos sensível à localidade de dados em sistemas de arquivos distribuídos",
                "paginas": 14,
                "autores": "Bruno Hott, Rodrigo Rocha, Dorgival Guedes",
                "universidade": "Departamento de Ciência da Computação Universidade Federal de Minas Gerais (UFMG) – Belo Horizonte, MG – Brazil",
                "lingua": "Pt",
                "resumo": "O crescimento acelerado dos dados disponíveis para pesquisas levou recentemente à popularidade de sistemas de processamento como Hadoop, Spark e outros, que se valem de sistemas de arquivos distribuídos para armazenar e acessar grandes volumes de dados. Para garantir um melhor desempenho, é importante que o processamento ocorra próximo aos dados, mas soluções atuais buscam localidade apenas no nível da rede local, não da mesma máquina. Este trabalho avalia o ganho de se colocar o processamento exatamente na máquina que contém os dados. Para isso, propomos um escalonador de tarefas sensível à localidade dos dados, integrado ao sistema de arquivos HDFS e ao escalonador YARN. Um protótipo foi implementado usando o ambiente Watershed e seu resultado comparado com outras políticas. Os resultados mostram que o escalonamento sensível ao posicionamento por máquina pode melhorar signiﬁcativamente o desempenho de aplicações que utilizam o HDFS e mesmo aquelas que já se valem de uma solução que tenta garantir o acesso a dados já em memória, como o Tachyon. Abstract. The accelerated growth of the volume of data available for researchers led recently to the increased popularity of distributed data processing systems like Hadoop, Spark and others. Those systems make use of distributed ﬁle systems to store, access and process big volumes of data. To guaratee better performance, it is important that the processing takes place close to the data. However, current solutions seek local network locality, not same machine locality. This work evaluates the gains of placing processing exactly in the same machine were data are. To achieve that we propose a data locality aware task placement scheduler integrated to the YARN scheduler and the HDFS ﬁle system. A prototype was implemented using the Watershed programming environment and its result is compared to other policies. Results show that scheduling based on machine-data placement can signiﬁcantly improve performance of applications that use HDFS and even those that already use a memory-based data access solution, such as Tachyon.",
                "link": ""
            },
            {
                "titulo": "Uma Análise do Tráfego de Controle de uma Nuvem IaaS Geodistribuída",
                "paginas": 14,
                "autores": "Tatiana Sciammarella, Rodrigo S. Couto, Marcelo G. Rubinstein Miguel Elias M. Campista e Luís Henrique M. K. Costa",
                "universidade": "Universidade Federal do Rio de Janeiro - PEE/COPPE/GTA - DEL/POLI Universidade do Estado do Rio de Janeiro - FEN/DETEL/PEL",
                "lingua": "Pt",
                "resumo": "As nuvens geodistribuídas são compostas por diversos servidores de máquinas virtuais espalhados em sítios interconectados por redes de longa distância. Nesse cenário, o tráfego gerado por mensagens de controle pode ser proibitivo, visto que o custo de banda passante nessas redes é elevado. Este trabalho avalia o potencial desse tipo de tráfego como um obstáculo ao aumento do número de servidores da nuvem. A partir dos resultados obtidos com o orquestrador OpenStack, estima-se que com 100 servidores e 15 máquinas virtuais por servidor gera-se um tráfego médio de cerca de 2,7 Mb/s para o controlador da infraestrutura. A essa média pode-se somar os picos de tráfego gerados durante a criação e a destruição de máquinas virtuais, agravando o problema. Esses resultados mostram que, caso a nuvem IaaS não seja bem planejada, o tráfego de controle pode se tornar uma preocupação para nuvens de menor porte, como as colaborativas e universitárias.",
                "link": ""
            },
            {
                "titulo": "A Middleware for Data-centric and Dynamic Distributed  Complex Event Processing for IoT Real-time Analytics in the  Cloud",
                "paginas": 16,
                "autores": "",
                "universidade": "",
                "lingua": "En",
                "resumo": "IoT big data real-time analytics systems need to effectively process and  manage massive amounts of data from streams produced by distributed data sources.  There are many challenges in deploying and managing processing logic at execution  time in those systems, especially when 24x7 availability is required. Aiming to address  those challenges, we have developed and tested a middleware for Distributed CEP, with  a data-centric and dynamic design, based on the Data Distribution Service for RealTime Systems (OMG-DDS) specification and its extension for dynamic topics/types  (DDS-XTypes). Its main advantages include the use of OMG-DDS; witch is suitable for  IoT applications with QoS requirements, its dynamic capabilities, and the scalable and  parallel execution of the CEP rules on a dynamic set of processing nodes.",
                "link": ""
            },
            {
                "titulo": "Atribuição dinâmica de canais em redes sem fio não  coordenadas IEEE 802.11, baseada em fatores de  sobreposição e intensidade de sinal",
                "paginas": 14,
                "autores": "",
                "universidade": "",
                "lingua": "Pt",
                "resumo": "As redes sem fio IEEE 802.11 têm se tornado uma das principais  responsáveis pelo crescimento do uso de dispositivos móveis e suas  aplicações. Este crescimento de dispositivos, que utilizam a banda ISM para  trafegar, gerou uma concorrência por porções de frequência disponíveis para  sua utilização, acarretando na diminuição da qualidade de tráfego e no  aumento da quantidade de ruído gerado. Este artigo descreve uma solução  não coordenada para a atribuição de canais em redes IEEE 802.11, baseado  em cálculos de sobreposição dos canais adjacentes combinada com sua  intensidade de sinal.  Os testes mostraram que a solução apresentou ganhos  de vazão e baixa convergência na atribuição dos melhores canais em cenários  com espectro em 2,4 GHz densamente ocupado.  1  Introdução  A banda ISM 2,4 GHz (Industrial, Scientific and Medical) é uma das mais concorridas  faixas de frequência não licenciada utilizadas atualmente. Compreendendo um intervalo  de frequência que vai de 2,4 GHz até 2,5GHz, esta banda é largamente utilizada em  redes sem fio que utilizam os padrões IEEE 802.11b/g/n. O padrão IEEE 802.11 divide  a utilização da ISM 2,4 GHz em canais 14 canais (variando de acordo com a região),  separando cada canal por 5 MHz e uma largura de banda de 22 MHz.     Esta divisão limitada de canais da banda ISM aliada ao crescimento da utilização  de redes Wi-Fi como solução de conectividade em cenários domésticos e coorporativos  fez com que problemas de reutilização de canal e interferências a partir de canais  adjacentes tornassem-se muito mais frequentes. Este tipo de interferência geralmente é  Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 704",
                "link": ""
            },
            {
                "titulo": "Reduzindo os Efeitos do  Bufferbloat  sobre Multi-Caminhos em Redes Sem Fio Heterogêneas",
                "paginas": 14,
                "autores": "Benevid Felix, Aldri Santos, Michele Nogueira",
                "universidade": "Núcleo de Redes Sem-Fio e Redes Avançadas (NR2) Universidade Federal do Paraná (UFPR)",
                "lingua": "Pt",
                "resumo": "A demanda por baixa latência e maior vazão no acesso à Internet tem impulsionado avanços na gerência da alta densidade existente das redes heterogêneas sem ﬁo (HetNets). O protocolo MPTCP (Multi-Path Transmission Control Protocol) possibilita dispositivos móveis embarcados transmitir dados por múltiplas redes através de tecnologias heterogêneas. Entretanto, o MPTCP gera degradações no desempenho em HetNets, ainda mais diante do fenòmeno bufferbloat. Este trabalho provê uma análise detalhada do controle de congestionamento do MPTCP em conjunto com a disciplina AQM CoDel, a qual se apresenta como promissora contra os efeitos do fenòmeno bufferbloat. Além disso, uma nova disciplina, a LIFO-CoDel, é proposta com o objetivo de reduzir a taxa de pacotes descartados pelo controle de congestionamento do MPTCP em redes heterogêneas sem ﬁo através do mecanismo de controle de congestionamento do MPTCP e da prioridade aos pacotes mais recentes. Resultados de simulações indicam a melhoria da vazão, mantendo o RTT baixo, e a redução do tempo de espera dos pacotes.",
                "link": ""
            },
            {
                "titulo": "LMT-MAC: um protocolo MAC multicanal livre de colisões para Redes de Sensores Sem Fio",
                "paginas": 16,
                "autores": "Gilson M. Júnior, Ariel F. F. Marques Luiz H. A. Correia",
                "universidade": "Departamento de Ciência da Computação – Universidade Federal de Lavras (UFLA) Caixa Postal 3037 – 37200-000 – Lavras – MG – Brazil",
                "lingua": "Pt",
                "resumo": "O protocolo da camada de controle de acesso ao meio (MAC) inﬂuencia diretamente na operação das Redes de Sensores Sem Fio (RSSF), impactando em diversas métricas como latência, vazão e taxa de entrega. Na literatura atual, protocolos TDMA multicanal usam mecanismos complexos para sincronização de tempo, alocação de canais e slots, geralmente inviáveis para dispositivos com hardware limitado. Neste trabalho, é proposto o Lightweight Multichannel Tree MAC (LMT-MAC), um protocolo MAC eﬁciente, baseado em TDMA, multicanal e livre de contenção. Resultados obtidos por meio de simulações mostram que o LMT-MAC é mais eﬁciente que outros protocolos tradicionais, e sua implementação em nós reais demonstram sua viabilidade.",
                "link": ""
            },
            {
                "titulo": "Uma Estratégia Híbrida e Iterativa para Roteamento e  Posicionamento de Nós OEO em Redes Ópticas Translúcidas",
                "paginas": 14,
                "autores": "",
                "universidade": "",
                "lingua": "Pt",
                "resumo": "Este trabalho propõe uma solução integrada para os problemas de  dimensionamento e posicionamento de nós regeneradores OEO e roteamento  multirrestritivo em redes ópticas translúcidas cientes das limitações da camada  física óptica. A nova estratégia proposta, chamada Iterative Approach for  Routing and Regenerator Placement (IARRP) é comparada com outros  algoritmos de dimensionamento e posicionamento de nós OEO sob as métricas  de utilização e dimensionamento de nós OEO. Além disso, por ser também,  simultaneamente, uma estratégia de roteamento multirrestritivo, a IARRP é  comparada com outras duas estratégias de roteamento multirrestritivo sob  diferentes métricas de desempenho e topologias de rede. A estratégia proposta  IARRP apresentou os melhores resultados em todos os cenários avaliados.  Abstract. This work proposes a new integrated solution for the OEO  regenerator nodes placement and multirrestrictive routing problems for  physical layer impairment aware translucent optical networks. The new  strategy named Iterative Approach for Routing and Regenerator Placement  (IARRP) is compared in terms of OEO utilization and number of OEO nodes  required in the networks with other OEO nodes placement algorithms  proposed in the literature. Furthermore, the IARRP approach is compared  with other multirrestricted routing algorithms. The evaluated scenarios  include several representative topologies for translucent optical networking.  For all studied scenarios, IARRP achieved superior performance.",
                "link": ""
            },
            {
                "titulo": "Nova Solução para o Problema de Roteamento em Redes Ópticas Elásticas utilizando Algoritmo Ciente de Fragmentação Baseado em Sistemas Fuzzy",
                "paginas": 14,
                "autores": "Ítalo Barbosa Brasileiro, José Valdemir dos Reis Júnior André Castelo Branco Soares",
                "universidade": "Departamento de Computação – Universidade Federal do Piauí (UFPI) Teresina – PI – Brazil",
                "lingua": "Pt",
                "resumo": "Neste artigo é apresentada uma nova solução para o problema de roteamento em Redes Ópticas Elásticas utilizando uma abordagem inteligente baseada em Sistema Fuzzy. O algoritmo proposto deﬁne a melhor rota para um dado par, considerando como métricas a fragmentação das rotas, a quantidade de slots livres e o índice do primeiro intervalo livre para o estabelecimento do circuito. As simulações para essa nova abordagem consideram as topologias USA e NSFNet, que ocupam grande área e possuem número crescente de usuários. Os resultados obtidos apontam que a abordagem proposta apresenta bloqueio 30,43% inferior ao DJK (Dijkstra), 20,87% inferior a outra implementação Fuzzy e 13,24% inferior ao MMRDS para a topologia USA, enquanto que para a topologia NSFNet apresenta bloqueio 95,45% inferior ao DJK, 78,03% inferior à outra implementação Fuzzy e 63,81% inferior ao MMRDS. Os desempenhos relatados para esta proposta possibilitam a exploração de novas técnicas inteligentes para melhorar a qualidade de serviço das Redes Ópticas Elásticas.",
                "link": ""
            },
            {
                "titulo": "Novo Algoritmo RMLSA com Roteamento  Multihop  em Redes Ópticas Elásticas",
                "paginas": 16,
                "autores": "Lucas R. Costa, André C. Drummond",
                "universidade": "Departamento de Ciência da Computação – Universidade de Brasília (UnB), 70910-900, Brasília, Brasil",
                "lingua": "Pt",
                "resumo": "A tecnologia de redes ópticas elásticas surge como uma solução promissora para o futuro da transmissão óptica de alta velocidade. Suas características proporcionam uma ﬂexibilidade e escalabilidade superior na alocação de espectro para os diversos serviços emergentes acompanhando a crescente demanda do tráfego da Internet. Em redes ópticas elásticas as demandas de tráfego são suportadas por uma atribuição de espectro, usando um número arbitrário de subportadoras OFDM, e um nível de modulação adequado, tendo em conta a distância de transmissão. A proposta deste trabalho, procura resolver o problema de roteamento e atribuição de espectro com modulação adaptativa, chamado RMLSA (Routing, Modulation Level, and Spectrum Allocation), através do uso da agregação de tráfego associado ao controle da modulação espectral no cenário de tráfego dinâmico. Para este ﬁm, propõe-se um algoritmo que procura realizar a maior quantidade de agregação óptica possível usando os níveis de modulação mais altos através de múltiplos saltos na topologia virtual. Os resultados mostram a redução na taxa de bloqueio sem comprometer a utilização dos recursos na rede.",
                "link": ""
            },
            {
                "titulo": "Um protocolo FSA com resolução imediata de colisões para sistemas RFID sob o efeito captura",
                "paginas": 14,
                "autores": "Henrique Stagni, Rafael Perazzo Barbosa Mota, Daniel Macêdo Batista",
                "universidade": "Departamento de Ciência da Computação – Universidade de São Paulo (USP) Rua do Matão 1010 – 05508-090 – São Paulo – SP – Brasil",
                "lingua": "Pt",
                "resumo": "O efeito captura é um fenòmeno comum em sistemas RFID. Quando múltiplas etiquetas respondem a uma solicitação simultaneamente, uma delas pode ser corretamente identiﬁcada devido a este efeito. Neste artigo é proposto um algoritmo que resolve colisões assim que elas ocorrem, o que é uma boa maneira de explorar um ambiente com efeito captura de forma a obter uma melhor eﬁciência de identiﬁcação. Ademais, o algoritmo proposto é de fácil implementação, é computacionalmente eﬁciente e modela o efeito captura de modo realístico. A proposta se baseia no algoritmo IDFSA-IcolR, um algoritmo FSA com propriedades similares mas que não considera efeito captura. Experimentos de simulação são realizados para comprovar as vantagens do algoritmo.",
                "link": ""
            },
            {
                "titulo": "Um Protocolo de Acesso ao Meio com Network Coding em Ambiente PLC.",
                "paginas": 14,
                "autores": "Luã M. F. Silveira ,Roberto M. Oliveira, Moises V. Ribeiro Luiz Filipe M. Vieira, Marcos Augusto M. Vieira, Alex B. Vieira 1. Introdução",
                "universidade": "Departamento de Ciência da Computação, Universidade Federal de Juiz de Fora Departamento de Engenharia Elétrica, Universidade Federal de Juiz de Fora Departamento de Ciência da Computação, Universidade Federal de Minas Gerais Comunicação via rede elétrica (PLC) atrai cada vez mais a atenção, tanto da comuni- dade acadêmica, quanto da indústria. A demanda por esse tipo de rede se dá por sua ﬂexibilidade/facilidade na conexão de dispositivos, baixo custo quando comparado a tec- nologias sem ﬁo e, até mesmo, por suas altas taxas de transmissão [Ezzine et al. 2014]. Como consequência desse interesse, cada vez mais nos deparamos com redes residenciais  de alta velocidade baseadas nesse tipo de rede. Ainda hoje, técnicas para transmissão de dados utilizadas em PLC podem apre- sentar altas taxas de falha, dado uma forte atenuação do sinal de comunicação [Gao et al.",
                "lingua": "Pt",
                "resumo": "Este artigo apresenta um caso de utilização de network coding, na camada de controle de acesso ao meio (MAC), em ambientes com comunicação via rede elétrica (PLC). Nós propomos e avaliamos o desempenho de um protocolo a partir de simulações de uma topologia comum em um sistema PLC com acesso múltiplo por divisão no tempo (TDMA-OFDM). O protocolo proposto utiliza o auxílio de um relay responsável de codiﬁcação dos MPDU’s. Nossos resultados apontam que, em uma transmissão tipo broadcast, o uso de network coding pode aumentar o goodput médio em até 115% em relação a um cenário tradicional equivalente, com uso de protocolos estilo stop&wait. Mais ainda, o novo protocolo diminui a ocupação média dos buffers dos dispositivos de rede em até 112%. Finalmente, as latências medianas observadas no sistema com o protocolo proposto são até 4 vezes menores.",
                "link": ""
            },
            {
                "titulo": "FTSP+: A MAC Timestamp independent ﬂooding time synchronization protocol",
                "paginas": 29,
                "autores": "Heder Dorneles Soares, Raphael Pereira de Oliveira Guerra Célio Vinicius Neves de Albuquerque",
                "universidade": "Instituto de Computação – Universidade Federal Fluminense (UFF) Av. Gal. Milton Tavares de Souza, São Domingos – Niterói – RJ – Brasil",
                "lingua": "En",
                "resumo": "Wireless sensors networks are distributed system composed of battery-powered nodes with low computational resources. Like in many distributed systems, some applications of WSN require time synchronization among their nodes. In the particular case of WSN, synchronization algorithms must respect the nodes computational constraints. The well known FTSP protocol is famous for achieving nanosecond precision with low overhead. However, it relies on MAC timestamp, a feature not available in all hardware. In this work, we propose MAC timestamp independent version in order to extend and adapt FTSP to work on hardware that do not have MAC timestamp while keeping the low overhead and high synchronization precision. Our results we estimate an average synchronization error of",
                "link": ""
            },
            {
                "titulo": "Um Controle de Autenticação de Handover Vertical para Prevenir Ataque de Repetição em Redes Heterogêneas Sem Fio",
                "paginas": 14,
                "autores": "Adi Marcondes, Michele Nogueira, Aldri Santos",
                "universidade": "Núcleo de Redes Sem-Fio e Redes Avançadas (NR2) – UFPR Caixa Postal 19.081 – 81.531.980 – Curitiba – PR – Brasil",
                "lingua": "Pt",
                "resumo": "As redes heterogêneas sem ﬁo possibilitam uma maior abrangência à transmissão de dados, visto que elas consideram a interoperabilidade em redes de tecnologias diferentes. Para isso, o serviço de autenticação oferece suporte à interoperabilidade e permite o controle de acesso dos dispositivos nas redes. Na literatura, vários esquemas de autenticação foram propostos para a segurança deste serviço durante a transição nas redes, porém estes esquemas não previnem o ataque de repetição de maneira eﬁcaz. Diante disso, este trabalho propõe o esquema de autenticação CAH para prevenir o ataque de repetição em redes heterogêneas. O esquema consiste de uma autenticação uniﬁcada entre redes de tecnologias diferentes utilizando o método de pareamento e a veriﬁcação da unicidade das mensagens na transição de redes. O mecanismo veriﬁca o tempo e a quantidade de mensagens, e envia informações dos dispositivos móveis para outras redes através da sobreposição. A avaliação deste esquema compara os resultados com o esquema UHA usando métricas de segurança e desempenho.",
                "link": ""
            },
            {
                "titulo": "Energy-efﬁcient Adaptive Encryption for Wireless Visual Sensor Networks",
                "paginas": 16,
                "autores": "Danilo de Oliveira Gonçalves, Daniel G. Costa",
                "universidade": "PGCA-UEFS, State University of Feira de Santana, Brazil",
                "lingua": "En",
                "resumo": "Wireless sensor networks are usually composed of small sensor nodes with low processing power, limited memory and restricted energy supply. Among them, camera-enabled sensors can be used to gather visual data, but some relevant processing and transmission challenges are raised. In general, sensor networks have many vulnerabilities that can be exploited by attackers, demanding defense measures. However, traditional security mechanisms may impose high computing and communication overhead, which may compromise network performance specially when visual data is sensed from monitored ﬁelds. In this context, this paper proposes a new paradigm to ensure energy-efﬁcient security for wireless visual sensor networks, deﬁning an adaptive encryption approach. Doing so, conﬁdentiality, authenticity and integrity are assured adaptively and according to application requirements, saving resources of networks while providing acceptable levels of protection for retrieved data.",
                "link": ""
            },
            {
                "titulo": "Um mecanismo baseado em SDN para ﬂexibilizar o controle de tráfego em redes LTE",
                "paginas": 14,
                "autores": "Luciano Jerez Chaves, Islene Calciolari Garcia, Edmundo R. Mauro Madeira",
                "universidade": "Depto. de Ciência da Computação – Universidade Federal de Juiz de Fora (UFJF) Rua José Lourenço Kelmer, s/n. São Pedro, Juiz de Fora – MG.  Instituto de Computação – Universidade Estadual de Campinas (Unicamp) Av. Albert Einstein, 1251. Cidade Universitária, Campinas – SP.",
                "lingua": "Pt",
                "resumo": "O rápido crescimento no acesso móvel à Internet está forçando as operadoras a gerenciar melhor o tráfego na rede, e as Redes Deﬁnidas por Software (SDN) surgiram como uma possível solução para este problema. O SDN é apontado como uma tecnologia facilitadora para superar as limitações atuais, reduzindo os custos, aumentando a escalabilidade e viabilizando as iminentes redes 5G. Este artigo apresenta um mecanismo baseado em SDN para controle de admissão e roteamento de tráfego no núcleo das redes Long-Term Evolution (LTE). Resultados de simulações destacam os benefícios que podem ser alcançados com este mecanismo. Também é discutido como esta e outras propostas na literatura contribuem para a ﬂexibilização dessas redes.",
                "link": ""
            },
            {
                "titulo": "Mecanismos de Alocação Dinâmica de Recursos do RACH para Controle de Congestionamento em rede LTE-A Ocasionado por dispositivos M2M",
                "paginas": 14,
                "autores": "David B. P. Aragão, Dario Vieira, Miguel F. de Castro",
                "universidade": "Universidade Federal do Ceará (UFC) Ecole d’Ingénieur Généraliste en Informatique et Technologies du Numérique (EFREI)",
                "lingua": "Pt",
                "resumo": "O modelo de comunicação Máquina-a-máquina (M2M) é considerado um dos pilares para o paradigma da Internet das Coisas. A rede LongTerm Evolution Advanced (LTE-A) apresenta-se, dentre as redes sem ﬁo, como potencial rede de acesso para o M2M. Contudo, o padrão LTE-A ainda herda algumas características de seus antecessores, que a priori, foram pensados para os modelos de comunicação Humano-a-humano (H2H) e Humano-a-máquina (H2M). Assim, emergem dessa integração do M2M com o LTE-A alguns desaﬁos, com destaque para o problema da sobrecarga e congestionamento na RAN (Radio Access Network) durante o procedimento de RACH (Random Access Channel). Neste artigo são propostos dois mecanismos baseados na estratégia de reserva de recursos do RACH para divisão dos recursos do canal entre as classes de dispositivos M2M e H2H. Para isso, o problema da escassez de recursos é modelado como um problema de falência e posteriormente aplicam-se duas soluções, sendo uma baseada na solução proporcional, e a segunda, utilizando um framework de jogos cooperativos com transferência de utilidade. Os resultados obtidos através de exaustivas simulações no simulador NS-3 mostram que os mecanismos propostos neste trabalho apresentam bons Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 893",
                "link": ""
            },
            {
                "titulo": "Mapeamento de Redes Virtuais Secundárias em Substrato  Sem Fio Baseado em Rádio Cognitivo: Formulação Multi- objetivo e Análise",
                "paginas": 16,
                "autores": "",
                "universidade": "",
                "lingua": "Pt",
                "resumo": "A virtualização sem fio (WV) é vista como uma solução para  gerenciar o ambiente de comunicação sem fio heterogêneo. Embora ela  proporcione melhor utilização de recursos, a subutilização deles ainda pode  ocorrer utilizando as abordagens atuais. Isto pode ser superado através da  combinação de WV com rádio cognitivo (CR) e técnicas de acesso dinâmico  ao espectro (DSA). Assim, redes virtuais primárias (PVNs) e secundárias  (SVNs) podem ser sobrepostas, onde as redes SVNs utilizam os recursos  oportunistamente. Este artigo apresenta o ambiente de redes virtuais de rádio  cognitivo, formula o problema de mapeamento de redes virtuais secundárias  (SVN) em redes de substrato (SN) baseadas em CR e analisa as métricas  envolvidas.",
                "link": ""
            },
            {
                "titulo": "Green Service Levels in Software Deﬁned Networks",
                "paginas": 14,
                "autores": "Bruno B. Rodrigues, Marco A. T. Rojas Viviane T. Nascimento, Tereza C. M. B. Carvalho and Catalin Meirosu",
                "universidade": "Escola Politécnica – University of São Paulo (EP-USP) São Paulo, Brazil Ericsson Research Stockholm, Sweden",
                "lingua": "En",
                "resumo": "The growing energy consumption has become a major concern for network service providers not only to reduce operational expenses, but also to minimize environmental problems related to the high energy expenditure. In this regard, assessing the energy consumed has become an important task to maximize energy efﬁciency, and thus, offer different green service levels for customers that desire to save energy. An SDN controller is presented that manages distinct green service levels based on power models to account for the consumed energy and energy saving capabilities. Speciﬁcally, we present three SLAs with distinct requirements in terms of energy consumption and models to account for power consumption for each network scenario. Our approach provides a ﬁne-grained accounting of user power consumption in distinct network usage scenarios in order to increase the accuracy of GreenSLA management in next generation networks. The proposal is validated by emulating two use cases inspired on the Facebook topology.",
                "link": ""
            },
            {
                "titulo": "Gerenciamento Flexível de Infraestrutura de Acesso  Público à Internet com NFV",
                "paginas": 14,
                "autores": "",
                "universidade": "",
                "lingua": "Pt",
                "resumo": "Os conceitos de Cidades Inteligentes, Internet das Coisas (IoT),  smartphones e outras tecnologias de computação pervasiva, já são realidade,  gerando demandas computacionais e de infraestrutura de telecomunicações,  exigindo flexibilidade, qualidade de serviço e redução de custo financeiro e  ambiental. Tecnologias como Virtualização de Funções de Rede (NFV),  Computação em Nuvem e Redes Definidas por Software (SDN) figuram como  promessa para solucionar essas demandas. Este trabalho utiliza NFV para  solucionar o problema de fornecimento dinâmico e elástico de acesso público  à internet nas grandes cidades. Os resultados obtidos demonstram níveis  significativos de desempenho e flexibilidade, além de métricas de comparação  de desempenho entre KVM, XEN e containers LXC em NFV.   1  Introdução  O processo de urbanização e a adoção de tecnologias altamente conectadas, como  smartphones, tablets, Internet das Coisas (IoT), casas inteligentes, redes veiculares,  entre outras, desencadearam novos desafios, tanto no que concerne ao processamento  desses dados como no transporte destes  por intermédio das redes de computadores. Este  arcabouço de problemas e soluções deu origem à área da computação urbana, que trata  o desafio das cidades inteligentes com uma abordagem computacional [Zheng et al.  2014].    Entre as abordagens utilizadas para tratar o problema computacional das cidades  inteligentes, destaca-se a computação em nuvem, que permite  a alocação de recursos  sob demanda, reduzindo investimento e apresentando-se como solução ambientalmente  responsável. Outro paradigma oriundo deste cenário é o Fog Computing,  onde a união  de nuvens públicas e privadas, computação embarcada, IoT entre outros elementos da  computação urbana formam um grande sistema [Stojmenovic and Wen 2014].  O tratamento do desafio de transporte dos dados deste ambiente também exige  soluções inovadoras, baratas e ambientalmente corretas – mobilidade e elasticidade são  premissas básicas para soluções de telecomunicações neste ambiente. A virtualização de  Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 937",
                "link": ""
            },
            {
                "titulo": "ROUTEOPS: Orquestração de Rotas Centrada na Operação de Sistemas Autònomos",
                "paginas": 16,
                "autores": "Rafael S. Guimarães, Magnos Martinello, Cristina K. Dominicini Dione S. A. Lima, Rodolfo S. Villaça, Moisés Renato N. Ribeiro",
                "universidade": "Núcleo de Estudos em Redes Deﬁnidas por Software (NERDS) Universidade Federal do Espírito Santo (UFES) – Vitória, ES Instituto Federal de Educação, Ciência e Tecnologia do Espírito Santo (IFES) Campus Cachoeiro/ES, Serra/ES – Brazil",
                "lingua": "Pt",
                "resumo": "A Internet é formada pela união de diversos sistemas autònomos (ASes), que utilizam o protocolo BGP para troca de informações de rotas. Em cada AS, seus operadores fazem uso de mecanismos arcaicos e obscuros na deﬁnição de políticas intra-AS e inter-AS. Nesse contexto, este artigo apresenta a ROUTEOPS: uma arquitetura para orquestração de rotas centrada na operação de ASes. A proposta se baseia na utilização de um controlador SDN com visão centralizada do AS que auxilia na deﬁnição de políticas mais expressivas e facilita a aplicação das mesmas. A visão centralizada é garantida pela integração da ROUTEOPS com os anúncios eBGP provenientes dos ASes vizinhos; o controle e a maior expressividade das políticas de roteamento são alcançados com o uso do OpenFlow e da centralização dos anúncios iBGP (intra-AS). A arquitetura proposta é implementada no Mininet e vários experimentos foram executados como prova de conceito, visando demonstrar sua viabilidade e as vantagens de sua utilização. ∗Este trabalho tem recebido ﬁnanciamento do projeto Horizon 2020 da União Européia para pesquisa, desenvolvimento tecnológico e demonstração sob no. 688941 (FUTEBOL), assim como do Ministério Brasileiro da Ciência, Tecnologia e Inovação (MCTI) por meio da RNP e do CTIC. Além disso, gostaríamos de agradecer o ﬁnanciamento do CNPq sob no. 456143/2014-9 e 449369/20145, e da FAPES sob no. 524/2015. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 951",
                "link": ""
            },
            {
                "titulo": "Intermediação por Espalhamento: Caminhos Quase Mais Curtos Também Importam",
                "paginas": 14,
                "autores": "Dianne S. V. Medeiros, Miguel Elias M. Campista, Nathalie Mitton Marcelo Dias de Amorim, Guy Pujolle",
                "universidade": "GTA / PEE-COPPE / DEL-Poli (UFRJ) – Brasil FUN Team (INRIA Lille-Nord Europe) – França LIP6/CNRS (UPMC Sorbonne Universités) – França",
                "lingua": "Pt",
                "resumo": "Métricas de centralidade de intermediação baseadas em caminhos mais curtos desprezam completamente a contribuição de nós ainda centrais, mas que estão em caminhos quase mais curtos. A ideia deste artigo é considerar esses nós não tão centrais, atribuindo-lhes maior importância. Para tanto, propõe-se a intermediação por espalhamento (ρ-intermediação), que atribui um peso a cada nó com base em quão mais longo é o caminho que pertence em relação ao mais curto. Esse peso depende do parâmetro de espalhamento ρ, que determina a diferença máxima tolerável entre os comprimentos do caminho quase mais curto e o mais curto. A análise da métrica é formalizada através da comparação entre os resultados da intermediação por espalhamento, tradicional e escalonada por distância, para três conjuntos de dados reais e um híbrido. Os resultados mostram que a ρ-intermediação melhora a conectividade da rede e é capaz de identiﬁcar nós mal classiﬁcados e atribuir maior importância a nós centrais que não necessariamente estão em caminhos mais curtos.",
                "link": ""
            },
            {
                "titulo": "Empregando Entropia na Detecção de Comportamento Automatizado nos  Trend Topics  do Brasil",
                "paginas": 14,
                "autores": "Adeilson Souza, Eduardo Feitosa",
                "universidade": "Instituto de Computação – Universidade Federal do Amazonas (UFAM) Av. Gen. Rodrigo Octávio, 6200 – 69.000-077 – Manaus – AM – Brasil",
                "lingua": "Pt",
                "resumo": "O Twitter permite a criação e propagação de postagens automatizadas para ﬁns comerciais, mas tal característica vem sendo utilizada indevidamente por bots sociais - contas automatizadas - para ﬁns maliciosos, especialmente nos Tópicos de Tendência (TT). Estudando as características e comportamento dos bots no Twitter, este artigo propõe seis novas características, baseadas no conceito de Entropia, com alto poder discriminativo e capazes de distiguir o comportamento automatizado nos TT no Brasil. A partir de uma base de dados real contendo 2.853.822 contas e 1",
                "link": ""
            },
            {
                "titulo": "Recomendações de Características Ergonòmicas para Interfaces de Sistemas de Monitoramento de Redes Baseadas em Critérios de Usabilidade",
                "paginas": 16,
                "autores": "Wilma E. Rosado, Leobino N. Sampaio, José A. S. Monteiro",
                "universidade": "Instituto Federal da Bahia (IFBA) Camaçari – BA – Brasil Programa de Pós-graduação em Ciência da Computação (PGCOMP) Instituto de Matemática – Universidade Federal da Bahia (UFBA) Salvador – BA – Brasil Centro de Informática (CIn) Universidade Federal de Pernambuco (UFPE) Recife – PE – Brasil",
                "lingua": "Pt",
                "resumo": "Por serem projetadas por especialistas, as interfaces de alguns dos atuais sistemas utilizados no monitoramento de redes possuem aspectos importantes de usabilidade negligenciados para usuários leigos. No intuito de auxiliar os projetistas no desenvolvimento de interfaces de sistemas de monitoramento de redes mais adequadas a usuários não especialistas, este artigo apresenta um conjunto de recomendações de características ergonòmicas criadas a partir de critérios de usabilidade. É ainda proposta uma metodologia de avaliação das interfaces com o objetivo de apresentar uma medida quantitativa de adequação das interfaces. A aplicabilidade das recomendações e da metodologia de avaliação propostas foram veriﬁcadas por meio da análise da ferramenta PerfsonarUI e um conjunto de ferramentas de monitoramento disponíveis no CAIDA.",
                "link": ""
            },
            {
                "titulo": "CI-PMIPv6 : Uma Abordagem para Handover Interdomínio em Redes Móveis",
                "paginas": 14,
                "autores": "",
                "universidade": "",
                "lingua": "Pt",
                "resumo": "O handover interdomínio é um tópico de pesquisa desaﬁador em redes móveis. Um dos principais desaﬁos é aliar baixo custo de sinalização com descentralização do gerenciamento de mobilidade. Este artigo propõe o protocolo CI-PMIPv6 (Clustered Interdomain Proxy MIPv6), que organiza entidades de vários domínios em um cluster, difundindo dados dos nós móveis com adição mínima de overhead de sinalização ao PMIPv6. Os resultados de avaliação mostram que de acordo com os cenários estudados e comparado a outras soluções na literatura, o CI-PMIPv6 obteve custo de sinalização ao menos 20% menor, latência no mínimo 16% inferior e perda de pacotes ao menos 16% menor. Ademais, o CI-PMIPv6 obtém goodput superior às demais abordagens.",
                "link": ""
            },
            {
                "titulo": "GROUPS-NET: Roteamento Ciente de Encontros de Grupos em Redes Móveis D2D",
                "paginas": 14,
                "autores": "Ivan Oliveira Nunes, Pedro O. S. Vaz de Melo, Antonio A. F. Loureiro",
                "universidade": "Departamento de Ciência da Computação – Universidade Federal de Minas Gerais (UFMG) Av. Antònio Carlos, 6627 – Pampulha, 31270-901- Belo Horizonte - MG - Brazil",
                "lingua": "Pt",
                "resumo": "A crescente ubiquidade de dispositivos móveis com capacidade de interconexão alavancou a possibilidade de comunicação dispositivo-dispositivo. Na próxima geração de comunicação celular, a comunicação dispositivodispositivo já é considerada uma funcionalidade fundamental. Fora do contexto de redes celulares, esse tipo de rede Ad-hoc também é referida como rede tolerante a atrasos (do inglês, DTN). Um problema fundamental em DTNs está em como deﬁnir algoritmos de encaminhamento de mensagens que, ao mesmo tempo, alcancem alta taxa de entrega aos destinatários e baixa sobrecarga na rede. Nas últimas décadas vários algoritmos foram propostos. Entre eles, algoritmos probabilísticos e algoritmos cientes de contexto social se destacaram como estratégias de maior sucesso. Porém, os algoritmos cientes de contexto social existentes na literatura não consideram a natureza dinâmica e evolutiva das relações de grupos sociais. Neste trabalho, propõe-se um protocolo probabilístico de roteamento oportunístico que considera reuniões de grupos e como as propriedades dessas reuniões evoluem ao longo do tempo. Para testes realizados em cenários de larga escala, o algoritmo proposto apresentou, em relação à solução do estado da arte, aproximadamente a mesma taxa de entrega com redução de 40% na sobrecarga da rede.",
                "link": ""
            },
            {
                "titulo": "Analisando a Capacidade de Descarregamento de Redes Móveis por meio de Redes Oportunísticas",
                "paginas": 16,
                "autores": "Vinícius F. S. Mota, Henrique Moura, Vinicius F. Silva Daniel F. Macedo, Yacine Ghamri-Doudane, José Marcos Silva Nogueira",
                "universidade": "Departamento de Ciência da Computação – Universidade Federal de Minas Gerais Belo Horizonte – Brazil L3i Lab – Université de La Rochelle La Rochelle – France",
                "lingua": "Pt",
                "resumo": "O paradigma de comunicação dispositivo-a-dispositivo surge como uma abordagem para aliviar o tráfego de dados de prestadores de serviços de Internet móvel. Nas redes D2D, dispositivos de usuário podem ajudar as operadoras a melhorar a cobertura celular, a eﬁciência do espectro e o descarregamento de dados. Este trabalho discute a viabilidade do descarregamento de dados móveis por meio de redes D2D através de um estudo quantitativo de três aplicações D2D: (i) Opportunistic Relaying (OpR), dispositivos em modo oportunista transmitem suas mensagens de dados para nós retransmissores em vez de enviá-las diretamente para a infraestrutura; (ii) Cache-and-Forward (CaF), nós retransmissores encaminham todos os conteúdos recebidos para todos os nós oportunistas encontrados dentro de um prazo limite; (iii) Relay-as-Cache (RaC), nós oportunistas procuram por um determinado conteúdo no cache dos nós retransmissores. Simulações mostram que em cenários com alta mobilidade e com alta tolerância a atrasos os nós retransmissores podem transmitir até 70% do tráfego de dados na aplicação OpR, 94% na CaF e até 35% na RaC. ∗Os autores gostariam de agradecer à CAPES, CNPq e FAPEMIG pelo apoio ﬁnanceiro parcial a este trabalho. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 1039",
                "link": ""
            },
            {
                "titulo": "Controlling Swarms of Unmanned Aerial Vehicles using Smartphones and Mobile Networks; an evaluation of the Latency requirements",
                "paginas": 14,
                "autores": "Bruno Olivieri, Marcos Roriz Junior, Markus Endler",
                "universidade": "Department of Informatics – Pontiﬁcal Catholic University of Rio de Janeiro Rio de Janeiro – RJ – Brazil",
                "lingua": "En",
                "resumo": "Swarms of Unmanned Aerial Vehicles (UAV) can be useful to several applications, such as urban surveillance and monitoring of mass events. To build and maintain a swarm formation, the UAVs need to compute, communicate, and coordinate their actions. However, it is complex to design and integrate computing and communicating chips into the UAV control board. Thus, in this paper, we argue that out-of-the-box Smartphones can be coupled to UAV and fulﬁll this role as a proxy computing unit, i.e., they can be attached to UAVs to do their computing and communicating tasks. Based on this hypothesis, we present a framework to coordinate the UAV swarms using conventional mobile networks. Then, we evaluate if this approach, under different latencies and swarm speed, is fast enough to coordinate the UAV Swarms. The results indicate that the proposed approach present stable swarm formations under 200 ms, a higher limit than standard 3G and 4G latencies. Further, the results show that the ratio leader speed communication latency is the key aspect that determines the swarm formation accuracy.",
                "link": ""
            },
            {
                "titulo": "Solução  Otima para Alocação de Recursos de Rádio com Restrições de QoS em Sistemas Multicelulares com Múltiplos Serviços",
                "paginas": 14,
                "autores": "Lászlon R. Costa, F. Rafael M. Lima, Yuri C. B. Silva F. Rodrigo P. Cavalcanti",
                "universidade": "Grupo de Pesquisa em Telecomunicações Sem Fio (GTEL), Universidade Federal do Ceará, Fortaleza, Brasil Programa de Pós-Graduação em Engenharia Elétrica e de Computação (PPGEEC), Universidade Federal do Ceará, Sobral, Brasil",
                "lingua": "Pt",
                "resumo": "Este trabalho propõe uma solução ótima para distribuição de RB (do inglês, Resource Block) considerando os efeitos da interferência, com o objetivo de maximizar a soma da taxa de dados total de um sistema multi celular com múltiplos serviços e restrições que assegurem um percentual mínimo de usuários satisfeitos para cada serviço. De forma a atingir uma experiência uniforme na área de cobertura, consideraremos critérios de satisfação de usuários localizados no centro e borda da célula. Resultados obtidos através de simulações computacionais mostram a importância de aplicar estratégias de gerenciamento de interferência em sistemas modernos e demonstram as vantagens da solução do problema formulado quando comparado às soluções encontradas na literatura. Abstract. This work proposes an optimal solution to the Resource Block (RB) distribution in order to maximize the sum rate in a multicell and multiservice system with constraints on the percentage of users that should be satisﬁed per service. In order to achieve a more uniform experience in the coverage we propose takes into account the satisfaction of users located at the center and edge of cells. Results of computer simulations show the importance of interference management in modern systems and the advantages of proposed solution when compared with others solutions found in the literature.",
                "link": ""
            },
            {
                "titulo": "An Energy-aware IoT Gateway, with Continuous Processing of Sensor Data",
                "paginas": 16,
                "autores": "L.E. Talavera, M. Endler, S. Colcher",
                "universidade": "Department of Informatics – Pontifícia Universidade Católica do Rio de Janeiro Rio de Janeiro, Brazil",
                "lingua": "En",
                "resumo": "Few studies have investigated and proposed a middleware solution for the Internet of Mobile Things (IoMT), where the smart things (Smart Objects) can be moved, or else can move autonomously, but remain accessible from any other computer over the Internet. In this context, there is a need for energyefﬁcient gateways to provide connectivity to a great variety of Smart Objects. Proposed solutions have shown that mobile devices (smartphones and tablets) are a good option to become the universal intermediates by providing a connection point to nearby Smart Objects with short-range communication technologies. However, they only focus on the transmission of raw sensor data (obtained from connected Smart Objects) to the cloud where processing (e.g. aggregation) is performed. Internet Communication is a strong battery-draining activity for mobile devices; moreover, bandwidth may not be sufﬁcient when large amounts of information is being received from the Smart Objects. Hence, we argue that some of the processing should be pushed as close as possible to the sources. In this regard, Complex Event Processing (CEP) is often used for real-time processing of heterogeneous data and could be a key technology to be included in the gateways. It allows a way to describe the processing as expressive queries that can be dynamically deployed or removed on-the-ﬂy. Thus, being suitable for applications that have to deal with dynamic adaptation of local processing. This paper describes an extension of a mobile middleware with the inclusion of continuous processing of sensor data, its design and prototype implementation for Android. Experiments have shown that our implementation delivers good reduction in energy and bandwidth consumption.",
                "link": ""
            },
            {
                "titulo": "Medição de desempenho de rede em  hardware",
                "paginas": 14,
                "autores": "Racyus Pacíﬁco, Pablo Goulart Italo Cunha, Marcos A. M. Vieira Dorgival Guedes, Alex B. Vieira, José Augusto M. Nacif",
                "universidade": "Universidade Federal de Viçosa – Florestal, MG – Brasil Universidade Federal de Minas Gerais – Belo Horizonte, MG – Brasil Universidade Federal de Juiz de Fora – Juiz de Fora, MG – Brasil",
                "lingua": "Pt",
                "resumo": "Tarefas de monitoramento e medição têm papel crucial em Redes Deﬁnidas por Software (SDNs). Infelizmente, a implementação de grande parte destas técnicas é realizada por software nas extremidades da rede (nós hospedeiros). Tal abordagem gera imprecisão, alto custo e diﬁculta o monitoramento. Neste artigo, nós estendemos o comutador OpenFlow de Stanford para implementar uma arquitetura de medições em redes SDN. Esta arquitetura pode realizar medições das redes independentemente dos nós hospedeiros de maneira simples, escalável e barata. Além disso, ela permite observar o desempenho na granularidade de ﬂuxos. Nosso protótipo foi implementado sobre a plataforma NetFPGA. Como instância inicial, nós implementamos um módulo para medir o tempo entre chegada de pacotes em um ambiente real. Nossos resultados mostram que nossa arquitetura apresenta baixa diferença relativa (próxima de 0%) em relação às medições do software nos nós hospedeiros.",
                "link": ""
            },
            {
                "titulo": "Coleta e Análise de Características de Fluxo para Classiﬁcação de Tráfego em Redes Deﬁnidas por Software",
                "paginas": 14,
                "autores": "Rodolfo Vebber Bisol, Anderson Santos da Silva, Cristian Cleder Machado Lisandro Zambenedetti Granville, Alberto Egon Schaeffer-Filho 1. Introdução",
                "universidade": "Instituto de Informática – Universidade Federal do Rio Grande do Sul (UFRGS) Caixa Postal 15.064 – 91.501-970 – Porto Alegre – RS – Brazil Email: {rvbisol, assilva, ccmachado, granville, alberto}@inf.ufrgs.br Redes de computadores e principalmente a Internet se tornaram essenciais para a vida moderna, sendo utilizadas por governos, empresas e instituições de ensino. Por isso, é muito importante identiﬁcar comportamentos anômalos e ataques de usuários maliciosos a ﬁm de manter o adequado funcionamento das redes.",
                "lingua": "Pt",
                "resumo": "Uma classiﬁcação acurada de ﬂuxos de tráfego é uma tarefa muito importante no âmbito de resiliência de redes de computadores, podendo ser aplicada para diversos objetivos, por exemplo, criar mecanismos para detecção de ﬂuxos de tráfego maliciosos. Estes mecanismos de classiﬁcação de ﬂuxos de tráfego, apesar de já serem muito soﬁsticados, ainda precisam ser aprimorados, pois certos ataques podem se camuﬂar entre os tráfegos benignos, que normalmente existem na rede, o que pode diﬁcultar a sua classiﬁcação. O objetivo deste trabalho é aprimorar as técnicas de seleção de características e classiﬁcação de tráfego propostas em trabalhos anteriores pela adição dos algoritmos Sequential Backward Selection (SBS) e K-means. Além disso, como validação dessa extensão, este trabalho realiza experimentos em um ambiente mais realístico, onde diversos tipos de tráfego coexistem e camuﬂam-se na rede. Os resultados dos experimentos indicam que a combinação do algoritmo SBS com os algoritmos de classiﬁcação de tráfego SVM e K-means permite a identiﬁcação de características adequadas para identiﬁcar tráfego malicioso. Abstract. An accurate ﬂow classiﬁcation is a very important task in network resilience and can be applied with many purposes such as to create mechanisms for malicious trafﬁc detection. These mechanisms although sophisticated still need to be reﬁned because certain attacks can hide amongst benign ﬂows that normally exist in the network which can hinder their classiﬁcation. The main objective of this work is to enhance the feature selection and ﬂow classiﬁer techniques proposed in previous work by the addition of the Sequential Backward Selection (SBS) and K-means algorithms. Moreover, as validation of our extension, this work conducts the experimental evaluation on a more realistic environment, where different ﬂow proﬁles coexist and camouﬂage in the network. The experiment results indicate that the combination of SBS with the SVM and K-means trafﬁc classiﬁcation algorithms allows the identiﬁcation of appropriate features to identify malicious trafﬁc.",
                "link": ""
            },
            {
                "titulo": "Avaliação de Desempenho de Planos de Dados OpenFlow",
                "paginas": 16,
                "autores": "Leonardo C. Costa, Alex B. Vieira Erik de Britto e Silva, Daniel F. Macedo Geraldo Gomes, Luiz H. A. Correia, Luiz F. M. Vieira",
                "universidade": "Departamento de Ciência da Computação Universidade Federal de Juiz de Fora (UFJF) – Juiz de Fora, MG – Brasil Departamento de Ciência da Computação Universidade Federal de Minas Gerais (UFMG) – Belo Horizonte, MG – Brasil Departamento de Ciência da Computação Universidade Federal de Lavras (UFLA) – Lavras, MG – Brasil",
                "lingua": "Pt",
                "resumo": "As Redes Deﬁnidas por Software (SDN) são marcadas pela separação dos planos de dados e de controle. O protocolo OpenFlow é uma implementação desse conceito que, devido às vantagens de menor custo de operação e maior inovação na rede, é encontrado hoje em diversos equipamentos comercializados por várias empresas. Apesar de ser muito utilizado na indústria e na pesquisa, não existe na literatura uma avaliação sistemática do desempenho do plano de dados OpenFlow. Neste trabalho apresentamos uma comparação de diferentes implementações OpenFlow, tanto em hardware quanto software, tendo em vista validar a maturidade das soluções comerciais existentes no mercado, e se os equipamentos existentes, quando operando em modo OpenFlow, operam com qualidade igual ou superior ao modo tradicional de operação. Os resultados mostram fortes indícios de que alguns fabricantes implementam OpenFlow em software, e também que a escolha da implementação impacta signiﬁcativamente no desempenho do switch. Anais do XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2016) 1127",
                "link": ""
            },
            {
                "titulo": "Roteamento e Alocação de Espectro Ciente da Aplicação em Redes  Opticas Elásticas",
                "paginas": 14,
                "autores": "Léia S. de Sousa, Lucas R. Costa, Felipe R. de Oliveira, André C. Drummond, Eduardo Adilio Pelinson Alchieri 1. Introdução",
                "universidade": "Departamento de Ciência da Computação (CIC) – Universidade de Brasília (UnB) Caixa Postal 15.064 – 70910-900 – Brasília – DF – Brasil Baseado no paradigma  (CLD), que rompe com o conceito de camadas isoladas promovendo a intercomunica ao vertical entre camadas, o rote- amento ciente da aplica ao ( , AA-R) se destaca do ro- teamento convencional por explorar informa oes a respeito das caracter ısticas de cada tipo de aplica ao, como , jogos  e de transfer encias de dados, e aplic a-las na melhoria do desempenho da rede e qualidade dessas aplicações [Gerber and Doverspike 2011], [Subramaniam et al. 2013]. As M ultiplas Transfer encias de Dados em Massa (MBDTs) s ao um exemplo de aplica ao que, por deﬁni ao, movimentam volumosas quantidades de dados ao longo de uma rede de centro de dados (CD) geo-distribu ıda, como forma de alcan ar melhor desempenho e maior conﬁabilidade. S ao implementadas nos ambientes de computa em nuvem para replicar e sincronizar as bases de conte udos de grandes provedores desse tipo de servi o [ Laoutaris et al. 2009 ]. Hoje, a aloca ao de recursos para MBDT e est atica com taxas previamente deﬁnidas, onde uma opera ao completa de transfer encia pode levar de dias a semanas, o que e feito tipicamente nos momentos de menor utiliza ao da rede (padr ao noturno) e leva os provedores a utilizarem armazenamento de dados em centros de dados alugados durante o dia, sendo que a rede n e ciente das aplica oes que s executadas; al em disso, n ao existem t ecnicas de engenharia de tr afego que garantam as transferências dentro de um especíﬁco período de tempo ( ) [Zhang et al. 2015]. O tr afego el astico das MBDT pode ser paralisado e reiniciado conforme prioridade deﬁnida pelos  (ISPs). Os canais utilizados s  de",
                "lingua": "Pt",
                "resumo": "Baseado no paradigma Cross-Layer Design (CLD), este trabalho apresenta uma solução de roteamento e atribuição de espectro ciente da aplicação (AA-RSA) de Múltiplas Transferências de Dados em Massa (MBDT), que são serviços de transporte de volumosas massas de dados em uma rede geodistribuída. O algoritmo proposto leva em consideração o padrão de tráfego de dados para melhorar o atendimento às demandas de ressincronização em redes utilizadas por centros de dados (CD), ou redes inter-centro de dados (ICD).",
                "link": ""
            },
            {
                "titulo": "Comutação de Mensagens  Opticas - OMS Um Novo Paradigma para Redes  Opticas",
                "paginas": 14,
                "autores": "Robson L. C. Canato, Gustavo B. Figueiredo, Juliana de Santi Nelson L. S. da Fonseca",
                "universidade": "Instituto de Computação - Universidade Estadual de Campinas (UNICAMP) Departamento de Ciência da Computação – Universidade Federal da Bahia (UFBA) DAINF – Universidade Tecnológica Federal do Paraná (UTFPR) – Curitiba",
                "lingua": "Pt",
                "resumo": "Neste trabalho, propõe-se um novo paradigma para comutação óptica em redes DWDM chamado Comutação de Mensagens Ópticas. A abordagem proposta alia o melhor encontrado na Comutação de Circuitos Ópticos (OCS), na Comutação de Rajadas Ópticas (OBS) e na Comutação de Fluxos Ópticos (OFS). A principal contribuição da abordagem proposta é permitir a reserva de recursos de forma dinâmica, visando utilização eﬁciente de recursos com garantia de qualidade do serviço oferecido. Os resultados demonstram redução na probabilidade de bloqueio de ﬂuxos e na probabilidade de bloqueio de bytes, o que evidencia os benefícios do paradigma proposto.",
                "link": ""
            },
            {
                "titulo": "Otimização de Roteamento com Protocolos Tradicionais para Aplicações Free-Viewpoint Television (FTV)",
                "paginas": 16,
                "autores": "Henrique D. Garcia, Priscila Solis",
                "universidade": "Departamento de Ciência da Computação – Instituto de Ciências Exatas Universidade de Brasília (UnB) – Campus Universitário Darcy Ribeiro Caixa postal 4466 – CEP 70.910-900 – Brasília – DF – Brazil",
                "lingua": "Pt",
                "resumo": "Este trabalho propõe uma metodologia de engenharia de tráfego que utiliza o parâmetro de autossimilaridade do tráfego de vídeo como restrição em um problema de programação linear Inteira (PLI) para a deﬁnição dos custos dos enlaces a serem utilizados pelo OSPF (Open Shortest Path First). O objetivo da metodologia é deﬁnir um valor de atraso máximo para transmissão entre a captura de imagens e os middleboxes que oferecem o serviço de FTV (Free Viewpoint Television). Os resultados experimentais mostram que a metodologia proposta pode reduzir signiﬁcativamente o atraso máximo na rede e permitir a identiﬁcação de valores de limiar para a carga nos enlaces que facilitem a deﬁnição de limites máximos de atraso em ambientes de transmissão de vídeo na Internet.",
                "link": ""
            },
            {
                "titulo": "Mininet-WiFi: Emulação de Redes Sem Fio Deﬁnidas por Software com suporte a Mobilidade",
                "paginas": 8,
                "autores": "Ramon dos Reis Fontes, Christian Esteve Rothenberg",
                "universidade": "Departamento de Engenharia de Computação e Automação Industrial (DCA) Faculdade de Engenharia Elétrica e Computação (FEEC) Universidade Estadual de Campinas (UNICAMP) Caixa Postal 6101, 13083-970 – Campinas – SP – Brazil",
                "lingua": "Pt",
                "resumo": "As redes sem ﬁo deﬁnidas por software (SDWN) têm sido relacionadas na mudança de paradigma em arquiteturas de redes baseado na programática entre os plano de controle e dados, permitindo a inovação no plano de controle e a utilização da infraestrutura subjacente por aplicações e serviços de rede. Apesar dos esforços na construção de uma visão sobre SDWN muitas questões ainda permanecem abertas em relação a sua viabilidade, incluindo meios efetivos para a experimentação e prototipação aplicáveis no mundo real. Sendo assim, nós propomos a emulação das redes sem ﬁo através do Mininet-WiFi como alternativa para alavancar pesquisas em SDWN através da utilização de pilhas de protocolos e aplicações existentes ao mesmo tempo em que é capaz de reproduzir o comportamento de redes sem ﬁo reais.",
                "link": ""
            },
            {
                "titulo": "ONS: Simulador de Eventos Discretos para Redes Ópticas WDM / EON",
                "paginas": 8,
                "autores": "Lucas R. Costa, Léia S. de Sousa, Felipe R. de Oliveira, Kaio A. da Silva, Paulo J. S. Júnior e André C. Drummond 1. Introdução",
                "universidade": "Departamento de Ciência da Computação – Universidade de Brasília (UnB), 70910-900, Brasília, Brasil A avaliação de desempenho dos sistemas de comunicação óptica é atualmente um desa- ﬁo para os especialistas. Sua dinamicidade e complexidade não permite uma modelagem analítica precisa e a implementação de ambientes reais para medição muitas vezes é in- viável por questões de custo e disponibilidade. A simulação é a alternativa disponível para atividades de teste, validação e avaliação de novos protocolos de controle para o am- biente de redes ópticas [Palmieri et al. 2009]. A simulação facilita a implementação de novos algoritmos fornecendo base para estudos e análises das características do plano de controle de maneira simples e escalável. Várias ferramentas de simulação para redes ópticas de código livre podem ser encontradas na literatura. Dentre tais ferramentas, muitas derivam ou são módulos de simuladores de rede IP ( ). Todavia, estas características trazem com- plexidades desnecessárias que podem ser abstraídas por simuladores exclusivos para rede óptica, permitindo uma maior velocidade de processamento por dispensar complexidades da camada IP. Por outro lado, também existem ferramentas proprietárias para tais ser- viços, entretanto suas características são limitadas e diﬁcultam a manipulação por parte",
                "lingua": "Pt",
                "resumo": "Este artigo apresenta o Optical Network Simulator - Wavelength Division Multiplexing / Elastic Optical Network (ONS - WDM/EON), uma ferramenta para avaliação de redes ópticas. O ONS é um simulador de eventos discretos capaz de simular tráfego dinâmico com chegadas e partidas de requisições para ambos os paradigmas de redes ópticas WDM e o recente EON. O ONS proporciona um ambiente para a exploração do desenvolvimento de novos protocolos RWA (Routing and Wavelength Assignment) para WDM e algoritmos para RMLSA (Routing, Modulation Level and Spectrum Allocation) do paradigma EON. São apresentados exemplos de execução e resultados para validação do simulador.",
                "link": ""
            },
            {
                "titulo": "SCSimulator: An Open Source, Scalable Smart City Simulator",
                "paginas": 10,
                "autores": "Eduardo Felipe Zambom Santana, Daniel Macêdo Bastista, Fabio Kon Dejan S. Milojicic",
                "universidade": "Department of Computer Science - University of São Paulo School of Engineering and Technology - Anhembi Morumbi University HP Laboratories - Palo Alto",
                "lingua": "En",
                "resumo": "Smart Cities, i.e., cities enhanced with a technological infrastructure that enables a more intelligent use and management of its resources, are currently seen as a powerful way of improving the quality of life of its citizens. Smart city platforms tailored at metropolises will be intrinsically very-largescale systems; designing and developing such systems will be a daunting task. Also, deploying an infrastructure to test smart city systems is challenging due to costs, risks, and political difﬁculties. Therefore, being able to simulate the execution of smart city scenarios would be extremely beneﬁcial for the advancement of the ﬁeld. This paper presents a new open-source, large-scale smart city simulator capable of simulating different smart city scenarios and its performance and usability are also discussed.",
                "link": ""
            },
            {
                "titulo": "OFSwitch13: Viabilizando o uso do OpenFlow 1.3 no ns-3",
                "paginas": 8,
                "autores": "Luciano Jerez Chaves, Islene Calciolari Garcia, Edmundo R. Mauro Madeira",
                "universidade": "Depto. de Ciência da Computação – Universidade Federal de Juiz de Fora (UFJF) Rua José Lourenço Kelmer, s/n. São Pedro, Juiz de Fora – MG.  Instituto de Computação – Universidade Estadual de Campinas (Unicamp) Av. Albert Einstein, 1251. Cidade Universitária, Campinas – SP.",
                "lingua": "Pt",
                "resumo": "O OpenFlow é uma tecnologia em rápida evolução que permite a implementação de Redes Deﬁnidas por Software. Apesar do simulador de redes ns-3 já possuir um módulo para simulações com o OpenFlow, é possível observar que a versão existente está bastante ultrapassada. Como diversas novas funcionalidades foram introduzidas nas versões mais recentes, é desejável que elas estejam disponíveis para uso. Assim, este artigo apresenta o OFSwitch13: um módulo que habilita o ns-3 para simulações com o OpenFlow versão",
                "link": ""
            },
            {
                "titulo": "OrchFlow - Uma Ferramenta para Orquestração de Múltiplos Controladores OpenFlow",
                "paginas": 8,
                "autores": "Marcelo Frate, Marcelo K. M. Marczuk, Fábio L. Verdi",
                "universidade": "Instituto Federal de São Paulo (IFSP) Boituva – SP – Brasil Universidade Federal de São Carlos (UFSCar) Sorocaba, SP – Brasil",
                "lingua": "Pt",
                "resumo": "O principal objetivo das redes deﬁnidas por software é a centralização da lógica de controle. Porém, é possível dividir esta lógica entre dois ou mais controladores com o intuito de garantir a escalabilidade. O protocolo OpenFlow deﬁne a comunicação entre switches e controladores, entretanto não prevê a comunicação entre controladores, necessária para qualquer tipo de distribuição no plano de controle. Faz-se necessário, portanto, o desenvolvimento de soluções independentes do protocolo, capazes de distribuir essa lógica dentro de um mesmo domínio administrativo. Neste cenário, desenvolvemos o OrchFlow, uma ferramenta capaz de orquestrar uma rede deﬁnida por software, com dois ou mais controladores OpenFlow, permitindo a gerência e o monitoramento da topologia em tempo real.",
                "link": ""
            },
            {
                "titulo": "TinySDN: Enabling TinyOS to Software-Deﬁned Wireless Sensor Networks",
                "paginas": 10,
                "autores": "Bruno T. de Oliveira, Cíntia B. Margi",
                "universidade": "Escola Politécnica – Universidade de São Paulo Departamento de Engenharia de Computação e Sistemas Digitais",
                "lingua": "En",
                "resumo": "Software-Deﬁned Networking (SDN) has been envisioned as a way to reduce the complexity of network conﬁguration and management, enabling innovation in production networks. While the ﬁrst SDN approaches focused on wired networks, there were proposals speciﬁcally for Wireless Sensor Networks, but none of them targeted the TinyOS environment. This paper presents the TinySDN tool, a TinyOS-based Software-Deﬁned Networking implementation. It comprises two main components: the SDN-enabled sensor node, which has an SDN switch and an SDN end-user device, and the SDN controller node, where the control plane is programmed. The SDN features have been implemented and tested in a real mote, and will be shown in the demo proposed.",
                "link": ""
            },
            {
                "titulo": "Cloud Capacitor : Uma Ferramenta de Apoio ao Planejamento da Capacidade de Aplicações na Nuvem",
                "paginas": 8,
                "autores": "Matheus Cunha, Marcelo Gonçalves, Nabor C. Mendonça, Américo Sampaio",
                "universidade": "Programa de Pós-Graduação em Informática Aplicada (PPGIA) Universidade de Fortaleza (UNIFOR) Av. Washington Soares, 1321, Edson Queiroz, CEP 60811-905 Fortaleza, CE",
                "lingua": "Pt",
                "resumo": "Este trabalho apresenta Cloud Capacitor, uma ferramenta para apoiar o planejamento da capacidade de aplicações em nuvens que oferecem infraestrutura-como-serviço (IaaS). A ferramenta é baseada em uma nova abordagem para avaliar o desempenho de aplicações na nuvem, denominada inferência de desempenho. Essa abordagem tem como premissa a deﬁnição de uma relação de capacidade entre diferentes conﬁgurações de recursos de um dado provedor de nuvem IaaS, a partir da qual é possível prever (ou “inferir”) o desempenho esperado de uma aplicação para uma ampla variedade de cenários de implantação, sendo que apenas uma pequena parte desses cenários precisa de fato ser implantada e executada na nuvem. A utilização da ferramenta é ilustrada através de um exemplo envolvendo a avaliação da aplicação de blogging WordPress no provedor de nuvem Amazon EC2. Abstract. This work presents Cloud Capacitor, a tool to support application capacity planning in infrastructure-as-a-service (IaaS) clouds. The tool is based on a novel performance evaluation approach for cloud applications, named performance inference. This approach relies on the deﬁnition of a capacity relation between different resource conﬁgurations offered by a given IaaS cloud provider, enabling one to predict (or “infer”) an application’s expected performance for a large variety of deployment scenarios, with the beneﬁt that only a small fraction of those scenarios need to be effectively deployed and executed in the cloud. The use of the tool is illustrated through an example evaluation of the WordPress blogging application in the Amazon EC2 cloud.",
                "link": ""
            },
            {
                "titulo": "Rufus: Ferramenta para o gerenciamento de infraestrutura para a execução de aplicações em containers",
                "paginas": 8,
                "autores": "Jonatan Souza, Allan Santos, Matheus Bandini, Henrique Klòh, Bruno Schulze",
                "universidade": "Laboratório Nacional de Computação Cientíﬁca (LNCC) – 25.651-075, Petrópolis, RJ, Brazil Faculdade de Educação Tecnológica do Estado do Rio de Janeiro (FAETERJ-Petrópolis) – Petrópolis, RJ, Brazil",
                "lingua": "Pt",
                "resumo": "Este artigo apresenta a ferramenta Rufus, cujo objetivo é permitir que usuários que detenham pouco ou nenhum conhecimento sobre gestão de infraestrutura, sejam capazes de submeter trabalhos para serem executados em um ambiente computacional adequado para a sua aplicação. Isso se dá através da submissão e da gerência das aplicações em uma Nuvem Computacional baseada na tecnologia de Containers. Através da ferramenta, é possível criar um ambiente dedicado, com conﬁgurações personalizadas de acordo com as necessidades de cada aplicação a ser executada. Além disso, o Rufus oferece recursos como autenticação, gerência de usuários e gerência de arquivos.",
                "link": ""
            }
        ]
    }
]